{
  "examVersion": "PMP 2026",
  "lastUpdated": "2026-01-28",
  "source": "PMP Udemy Transcript - Andrew Ramdayal TIA Education",
  "domains": [
    {
      "id": "domain1",
      "name": "People",
      "examWeight": 33,
      "description": "The skills and activities associated with effectively leading a project team",
      "taskCount": 14,
      "tasks": [
        {
          "id": "d1t1",
          "taskNumber": "Task 1",
          "title": "Manage conflict",
          "fullTitle": "Domain 1 Task 1: Manage conflict",
          "content": "--- Domain 1 Task 1 ---\n\n-: In this video, I'm gonna be talking\nabout Domain 1: Task 1, manage conflict.\nSo, let's get into it.\nManaging conflicts.\nYou know, I personally believe that project management\nshouldn't be called project management.\nIt should be called problem management, right?\nBecause managing a conflict is all about managing problem.\nThroughout the day,\nyou're gonna be managing a lot of problems.\nI manage a ton of projects here at TIA.\nRunning a school means I'm gonna be managing\na lot of conflicts.\nAnd basically when I pick up the phone\nand I call my assistant,\nI call a director of location.\nFirst thing I'm gonna do, any problems?\nWhy? Because I know there's gonna be some kind of conflict.\nAnd as a project manager,\nyou have to be ready to manage these conflicts.\nIt's just the nature of the work.\nIt's welcome to project management.\nYou don't like problems.\nI think you brought the wrong course because if you,\nbut if you love solving problems,\nthat's what this is about.\nI am a hundred percent sure you're gonna have quite\na few questions on your exam about managing conflicts\nbetween team members, between a customer and a team member,\nbetween you and a team member, between you and a sponsor,\nyou and a functional manager, a functional manager\nand a team member.\nEvery possible combination we can think about,\nthey can ask you when it comes\nto managing conflicts amongst team members.\nNow, let's take a look\nat what PMI wants us to know.\nSo the first thing up, manage conflicts.\nWhat the first thing you're gonna be able\nto do is you wanna interpret\nthat particular source and stage of the conflict.\nYou wanna say to yourself,\nwhere did this conflict come from?\nWhat started the conflict?\nAnd then you wanna know the stage of the conflict,\nlike how much has it escalated?\nOne of the main things with being a good project manager\nis you don't want conflicts to escalate too high up.\nEscalation means harder to deescalate it.\nThink about this.\nIf two, if let's say two team members are having an issue,\nwhat programming method should we use?\nAnd you come to solve the problem.\nThe earlier you're there is\nthe less shouting that's happening.\nBecause at the beginning of a conflict,\neveryone is pretty open-minded or they may be\nwilling to listen, but the more they talk\nand the more they get angry with each other,\nhey, the harder it is gonna get to solve\nbecause it's gonna be harder to deescalate it.\nSo, we wanna know where that conflict happened\nand what is the stage of the conflict,\nwhere it's in right now.\nWhat's the context?\nWhy did the conflict occur? Right?\nFirst of all, look at the source.\nWhere did it come from?\nWhat started it?\nWhat's the stage?\nWhat's the conflict?\nWhat's being affected on a project?\nThen finally, evaluate, recommend and reconcile\nthe appropriate conflict solution.\nSo, you're gonna have to evaluate this conflict.\nYou're gonna probably recommend or come up with ways\nor come up with some kind of reconciliation\nbetween the people on the conflict to solve it.\nThat's how you would fix this.\nNow, I'm gonna give you guys the exam tip.\nHere's the exam tip.\nOn any exam question,\nwhere you have to solve a conflict\nbetween any type of team, any type of team or stakeholders,\nwhatever combination you want.\nThe answer is always gonna be to involve people\nin the solution\nand use tools that are inclusive, not exclusive.\nThis is something we talked about in our agile section.\nSo, for example, Bob and Jane is having a problem,\nthat'll be the question.\nThey couldn't decide on what method to program the software.\nWhat should you do as a project manager?\nOne of the choices is gonna say,\ndetermine the best solution,\nand tell them what it is, that's wrong,\n'cause now you're not including them.\nYou're doing it yourself.\nSpeak to Bob and find out what his solution\nand if you agree with it, implement that.\nThat's wrong because now you're not including Jane.\nSpeak to Jane and not include Bob.\nThat's wrong.\nThe answer would be to bring the team together\nand then come up with a solution that makes sense for both\nof them by having them doing a face-to-face discussion,\nsomething that's inclusive, bringing them in.\nThat's the answer.\nNow you're gonna get a lot\nof questions on your exam about managing conflicts.\nRemember, I can't emphasize this enough,\nany choice that you see, ask yourself this question,\nis this the inclusive choice?\nIs this the choice\nthat includes everyone joining in\nand helping out to come up with a solution?\nIs this the choice that includes them participating?\nThat's gonna be the answer.\nSo, remember that when it comes to solving any type\nof question on your exam about managing a conflict.",
          "keyConcepts": [
            "agile",
            "conflict"
          ],
          "transcriptLines": {
            "start": 15054,
            "end": 15177
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t2",
          "taskNumber": "Task 2",
          "title": "Lead a team",
          "fullTitle": "Domain 1 Task 2: Lead a team",
          "content": "--- Domain 1 Task 2 ---\n\n-: In this video,\nI'm gonna be going over domain one: People,\ntask two: Lead a Team.\nSo in particularly task two.\nIt is part of any project manager's job to lead the team.\nThe team will look up to you.\nThe team will look at you for the vision.\nThey would look at you to help solve conflicts.\nThey look at you to know what to do next\non traditional projects.\nYou'll help to remove impediments and obstacles\non an Agile project while being a servant leader.\nSo there are some really important things we need to know\nas being a project manager\nin order to have a successful project.\nYou gotta remember something.\nThe work on a project is done by the team\nnot the project manager.\nAs a project manager, we're not gonna paint the wall,\nwe're not gonna code that application.\nWho's gonna do that? The team is who's gonna do that.\nWe need to lead the team\nto successfully build that application,\nto successfully paint that wall and so on.\nSo in this particular task\nPMI has given us quite a few enablers.\nThis is actually one of the largest tasks of those 35 tasks.\nLet's take a look at what they are.\nWe'll go through each one of them.\nSo here I have all of the different things\nthat we need to take a look at.\nAnd the first thing up when leading a team\nis you want to set a clear vision and a mission.\nA team must know what this project is about.\nThey must know the end product.\nYou must learn to think backwards to show them that vision.\nTell them, at the end\nthis is what the product should look like.\nThis is how it's gonna help the organization.\nLet them know what's expected of them.\nLet them know the mission of what this product will do\nand the vision of how it's gonna help the organization.\nWhen a team feels that what they're doing means something\nto that business, they feel more responsible.\nThey start taking more responsibility for the work\nthat they're about to embrace on.\nThe next thing you wanna do,\nsupport diversity and inclusion.\nYou're gonna have to remember that in today's world\nyou're gonna have a lot of different people\nwith different backgrounds, different cultures,\neven in fact, different languages,\nespecially on virtual teams,\ndifferent behavior types, thought process.\nYou're gonna wanna make sure that you support this.\nWe talked about this in Agile.\nUse tools that are inclusive, not exclusive.\nTry to do things when you're talking to the team.\nWhen you're negotiating with a team,\nwhen you're leading with a team, try to have people talk.\nTry to do discussions where everyone is included\nand you're not just there speaking to someone.\nWhen it comes to problem,\nand we talked about in the previous task,\nwhen it comes to problems and resolving conflicts,\ninclusion is always the way to go.\nIn Agile, we talked about value servant leadership.\nServant leadership is quote-unquote,\n\"fetching food and water.\"\nRemoving impediments and obstacles from your team.\nExpect a question on your exam\nwhere they're gonna give you some kind of problem.\nAnd the answer's probably gonna be\nwhere the project manager solves it themself\nand doesn't provide it to the team.\nI'll give you guys a tip on this.\nI've seen a question like this.\nAnd if you come to some kind of issue\nwhere it's an issue where the team has good inputs\nand the team can solve it, let the team solve it.\nIf it comes to some kind of issue\nwhere it's an administrative problem\nor administrative issue that belongs to the organization\nor the project manager, fix it.\nDon't give it to the team.\nThis is how you're gonna remove impediments.\nRemove obstacles. Let the team do what they do best.\nIf they're programmers, let them program.\nLet them solve problems related to programming,\nnot to clericals or administrative updating plan type thing.\nOkay, the next thing here is we want to know what type\nof leadership style are we gonna be.\nA directive leader? Are we gonna be a collaborative leader?\nYou have to know when to use one over the other.\nNow for example, if you're doing a project\nlike building a large skyscraper and regulations are in play\nand the work has to be done in a particular order\nto a particular standard or regulatory law,\nthen it's probably good to be a directive leader\nwhen you're directing the team.\nThis is what we must get done. There's no collaboration.\nIf the law says that this wall has to be painted green\nbecause of some kind of safety regulation,\nthere's no collaboration on this.\nThey must do this. This is being a directive leader.\nCollaborative leaders now,\nif there is an issue on a software\nwhere there might be multiple correct solutions\nand we gotta choose one of these,\nthen it's good to do an inclusive collaborative solution.\nBring the team together, have them talk it out\nand they'll find the right solution.\nAlways remember what I told you in Agile,\nlet the team fix it.\nThat's the answer. Always let the team fix it.\nBut remember, on certain projects with directive\nwhere regulations are involved, you might just not do that.\nInspire, motivate, and",
          "keyConcepts": [
            "collaboration",
            "servant leadership",
            "agile",
            "virtual team",
            "regulatory"
          ],
          "transcriptLines": {
            "start": 15843,
            "end": 16078
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d1t3",
          "taskNumber": "Task 3",
          "title": "Support team performance",
          "fullTitle": "Domain 1 Task 3: Support team performance",
          "content": "--- Domain 1 Task 3 ---\n\n-: In this video,\nI'm gonna be talking about task domain one task three,\nwhich is support team performance.\nWhen a team starts to work, you're gonna have to ensure\nthat you support them in getting the work done.\nThis is one of the tenets of being a servant leader.\nBeing a servant leader is to remove obstacles\nand impediments and fetching food and water,\ngiving them the tools\nand the space they need to be successful.\nBut as you're managing the team,\nyou have to be able to ensure\nthat that team performs at a level\nthat's getting the project work done in a timely manner\nand in a manner that's satisfiable\nto the basically the bosses or the sponsors\nor the customers on that project.\nLet's take a look at what this particular one is about.\nSo the first thing up we have\nis appraise team members' performance\nagainst key performance indicators.\nWe have to assess our team\nagainst some kind of KPI, key performance indicators,\nthat we have set up.\nNow, KPIs could be something as simple\nas how much work they're getting done,\nhow fast they're getting it done.\nA KPI could be how much disagreements they may be having.\nSo let's say you are doing an Agile project\nand the team's velocity\nis around let's say 50 points per iteration,\nand they're doing that 50 points per iteration\nover and over and over.\nSo that would be a KPI that you can set up\nso you can measure their performance\nif they're getting 50 points' worth of work done.\nSo you have to look at,\nyou have to measure their performance against something.\nYou can't just look at them and says,\n\"Oh they're doing well, or they're not doing well.\"\nThere has to be some kind of objective measurement\nthat we can use.\nNot so much subjective, but something objective,\nsomething numerical, something that people can agree with.\nSomething that we can look back on\nand say, \"Okay, so that's how they're doing.\"\nWe have to know this is gonna tell us are they working good?\nDo they need more coaching?\nDo they need more training?\nBecause if we don't know this,\nthen how would we support them?\nThe next thing we're gonna do is support\nand recognize team members' growth and development.\nOn your exam, you should expect questions\nwhere team members\nis gonna have issues.\nOne or two members may have an issue on something.\nThe answer is to train them.\nThey don't know how to do something, coach them.\nThey don't understand something, coach them.\nThey don't know how to use the tools,\nmake sure they're trained correctly.\nThis will help them to grow.\nTeam members not knowing how to do something\ncan become frustrating to them,\nand it will slow down the team's velocity.\nTeam members should be willing to ask each other for help\nin case needed.\nThat's the support of the Agile project.\nThe next thing you wanna do\nis determine the appropriate feedback and approach.\nWe just talked about this.\nWe wanna make sure that whatever it is with this team,\nif they're having issues, we're gonna get it resolved.\nIf they need particular tools, we'll help get it for them.\nIf they need training, we'll help get it for them.\nOnce they're working,\nwe have to verify performance improvements.\nOnce you have given the team the tools they need,\nthe training they need, look back at those APIs.\nLook back at the performance they're doing\nto see if their performance is getting better.\nIf you find their performance are not getting better,\nthen take more actions to ensure that it does get better.\nOkay, so this is task three here, support team performance.\nRemember, we wanna make sure that we assess them\nagainst some kind of KPI.\nWhatever they need, give it to them,\nsupport them, train them, coach them.\nGive them the right tools,\nthe right space, the right environment.\nAnd then you wanna verify\nthat these performance improvements\nare actually working\nto ensure that the performance of the team\nis going up and not down.",
          "keyConcepts": [
            "agile",
            "team performance",
            "training",
            "performance"
          ],
          "transcriptLines": {
            "start": 16078,
            "end": 16177
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d1t4",
          "taskNumber": "Task 4",
          "title": "Empower team members and stakeholders",
          "fullTitle": "Domain 1 Task 4: Empower team members and stakeholders",
          "content": "--- Domain 1 Task 4 ---\n\n-: In this video I'm gonna be going over\nDomain 1, Task 4.\nEmpower team members and the stakeholders.\nSo you're managing a team throughout the entire project,\nand not just one team,\nbut if you're a project manager for the entire team,\nyou're gonna manage many different teams.\nOne of the things we have to do\nis we have to empower those teams.\nWe wanna make them feel important.\nWe wanna make them feel\nthat the work they're getting done actually counts.\nAnytime people feel that they're contributing to something,\nanytime people feel that what I did\nis really gonna make a difference to this organization,\nthat makes them feel empowered,\nthat makes them feel accountable,\nthat makes them feel, oh man, I gotta get this done\nbecause there's so many people dependent on me.\nWhen I get up here to teach these classes,\nyou guys would be surprised to know\nhow many times these videos are retake,\nbecause sometimes I do a video and I say to myself,\nwell, I'm not too happy with it,\nI don't think I'm giving them the best of my ability.\nI rethink it,\nI write some things down,\nand I do it again.\nThis is the fourth time doing this video,\nso I'm hoping this one turns out good.\nYou guys can let me know in the comments.\nOkay, so let's go back to this, right,\nbecause if I feel that I make a difference,\nif you guys are telling me,\nAndrew, you're making a difference,\nI get great reviews from you guys,\nnow I feel empowered.\nNow I feel that I wanna keep doing this,\nand I wanna keep making you guys successful.\nThis is how we're gonna manage a team.\nSo empower the team,\nempower team members and stakeholders.\nThe first thing we wanna do\nis organize around the team strengths.\nBefore you do that,\nyou need to know what are your team strengths?\nWhat exactly are they strong at?\nWhat are they not too good at?\nFor example, your team may be great\nat using particular tools in order to get the work done,\nbut one of their weaknesses may be\ncommunicating amongst each other,\nor maybe vice versa, or maybe both is good.\nMaybe they're good at communicating,\nmaybe they're good at using their tools.\nSo you wanna know what is the strength of this team?\nMaybe the team has good problem solving skills,\nbut it takes a while to get there\nif there's many conflicts in between it.\nYou wanna make sure you know what those skills,\nthose strengths are,\nyou wanna make sure that you organize around them.\nThen you wanna support team task accountability,\nand evaluate demonstration of these task accountability.\nSo the task is the work that they're gonna be doing,\nand the other one is the accountability aspect.\nThe team should know\nthat they're gonna be held accountable\nfor the completion of these tasks.\nThey should know that once they select tasks\nto get finished, or work from the work breakdown structure,\nor the product backlog,\nthey should know,\nhey, we selected that,\nthis is the work we're gonna get done,\nthe team had input in saying how much work can get done\nin this timeframe, in this sprint iteration,\nin this particular timeframe in a traditional project,\nwhen the project executes,\nthey're now gonna be held accountable for that.\nThe next thing is you wanna determine and bestow\nlevels of decision making authority on the team.\nWe want to give them\nthe ability to make decisions, right?\nBecause you gotta remember something.\nWhen a team makes a decision,\nor comes up with a way to solve an issue,\nor a way to do something,\nlike a way to program an application,\na method to paint a wall or something,\nthat's probably a practical way.\nTeam members see it in a practical way\nbecause they're the one\nthat's actually gonna have to physically do it.\nSo give them that authority.\nAs a servant leader,\nwe are gonna bestow that level of authority\nto our team members,\nand that's gonna let them feel empowered.\nOkay, the organization is dependent on us.\nThis is different, right?\nBecause in some projects\nit may just be you don't bestow any authority making to them\nand you're the one holding all the power,\nand the team is always watching you of what to do next.\nThey look at you or what to do next.\nIn a servant leader, that's not the case.\nThey're doing the work,\nand they're just hoping to get support from you.\nThey're determining the way to program that application,\nthey're just getting support from you.\nVersus on some projects like regulatory projects,\nhigh regulations, building a financial applications,\nor parts of it, on a hybrid project, for example,\nwhen the regulation starts to come into play,\nyou may not bestow authority on them.\nSo you have to know what that environment is,\nwhat type of project you're working on,\nbefore you start bestowing authority on them.\nOkay, so really interesting task here.\nMake sure you understand\nthat we wanna keep these team members empowered,\nand we wanna make sure\nthat we give them the right level of decision making.",
          "keyConcepts": [
            "iteration",
            "work breakdown structure",
            "regulatory",
            "empower",
            "members",
            "stakeholders"
          ],
          "transcriptLines": {
            "start": 16177,
            "end": 16304
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d1t5",
          "taskNumber": "Task 5",
          "title": "Ensure team members and stakeholders are adequately trained",
          "fullTitle": "Domain 1 Task 5: Ensure team members and stakeholders are adequately trained",
          "content": "--- Domain 1 Task 5 ---\n\n-: In this video,\nI'm gonna be taking a look at Domain 1, Task 5.\nWe're looking at ensure team members,\nstakeholders are adequately trained.\nLet's get started.\nSo we're talking about training of team members.\nNow, as a project manager, you're managing a team.\nYou're gonna find many, many times\nthat team members may not be adequately trained\nto utilize a specific tool.\nThey may not know how to do a particular method\nin order to program that application or paint that wall.\nSo you're gonna have to make sure\nthat they get the right training.\nNow, training options are variant.\nYou have online training,\nyou have live online training,\nyou have classroom training.\nYou can hire consultants that come in and train them.\nYou can hire outside companies.\nThere are many, many training options that are available.\nSo we're gonna have to know what these options are.\nYou're gonna wanna make sure\nthat you know what is best for that team.\nYou have to analyze the team\nand see how do they learn best?\nDo they learn best with a live in-person training?\nDo they learn best with a face-to-face\nin a classroom training?\nYou have to know what's best for your team.\nSpeak with the team, engage the team, ask the team,\ndiscuss with the team.\nThen provide the training.\nThen you have to evaluate\nwhether the training was effective or not.\nSo let's take a look at the particular enablers\nthat PMI wants us to know.\nSo the first thing here is we have\nto determine required competencies and elements of training.\nWe have to first determine what is it we want out\nof this training?\nWhat particular competencies and elements\nof the training are we looking for?\nWe have to determine,\nmaybe they need to use that particular tool,\nmaybe they need to use that particular process.\nWe have to know, oh, they're using this new software tool\nto push out the application or program it.\nDo they have the right skill?\nDo they have the right competency?\nIs that training adequate?\nThen we have to determine the training options based\non their training need.\nSo we have to find the right class.\nMake sure they know whether that class fits their needs.\nFor example, if they need to learn software A,\nyou don't wanna send them to train in software B.\nYou wanna make sure that you have the right resources\nfor training.\nNow, this is something that you probably would've taught\nabout since the initial budgeting of the project.\nSo you wanna make sure you allocate.\nIf not, go back.\nDo a change request.\nGet the right funding needed to get the team trained.\nNow, when training is done,\nright, when the training is completely finished,\nyou're gonna wanna make sure\nthat you measure the training outcome.\nYou wanna make sure that you know\nwhether this training was adequate or not.\nHow are you gonna do that?\nThis can be done with surveys,\njust surveying the individual team members.\nThis can be done\nby actually watching them perform their work.\nThis can be done\nby seeing how fast they're getting work done.\nFor example, if the software was supposed\nto actually increase their performance\nand make it easier to pump out code\nand program that application quicker,\nis it actually doing that?\nBecause then you'll know whether this training works\nor maybe this wasn't the right training for them.\nYou should expect questions on your exam about training,\nwhere they're gonna tell you\nthat some kind of problem is happening in the team\nor the team is not happy using something\nor they don't have the adequate skill.\nThe answer is gonna be to get them trained.\nSo if you ever see that as a choice,\nensure the team member is trained,\nthat's probably gonna be the answer to that question.",
          "keyConcepts": [
            "training",
            "change request",
            "members",
            "stakeholders",
            "adequately",
            "trained"
          ],
          "transcriptLines": {
            "start": 16304,
            "end": 16401
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t6",
          "taskNumber": "Task 6",
          "title": "Build a team",
          "fullTitle": "Domain 1 Task 6: Build a team",
          "content": "--- Domain 1 Task 6 ---\n\n-: In this video, I'm gonna be talking\nabout Domain 1: Task 6, Build a Team.\nBuilding a team is one of the most fundamental aspects\nof being a project manager.\nBeing able to select who you would like to be on your team\nis a great thing,\nbut sometimes that's not always the case\nteams are handed to you.\nAnd when that is, you have to then develop that team.\nAnd even you selecting the team members to be on your team\nto build your own team,\neven though that's a great thing,\nyou have to come and understand a few things.\nNumber one, over the years of writing books,\nmeeting so many teams, helping companies build PMOs,\nworking on my own projects with my own team,\nif there's one thing I've learned,\nnot everyone is good for every team\nand not every team is good for every project.\nYou probably know that already though.\nSo when we build a team,\nwe wanna make sure that we have the right stakeholder\nwith the right skill.\nWe wanna make sure that we understand\nwhat the resource requirements were for the project,\nso we can select the stakeholder\nor the team member with the right skill.\nYou wanna consistently assess them\nand make sure that you selected the right person.\nAnd if not, you wanna make sure\nthat they get the right training needed\nto develop those skills.\nThen you wanna maintain them\nand eventually do a knowledge transfer.\nSo that's what this particular section is about.\nLet's get into it here,\njust to basically repeat what I just told you.\nSo Task 6 here is build a team.\nAnd inside of it, we're looking at the first thing is,\nwe gotta appraise the stakeholder skills.\nWe gotta assess, what is the skills of these people\nthat may be potentially joining our team?\nWe have to go through it.\nWe have to say,\n\"Okay, that member may be sufficient for this.\nThis person isn't.\"\nSomeone that is a good network person,\nI personally have never met a good networking guy\nto be a good programmer.\nI'm a networking guy and I really am bad at programming.\nAnd I've also not met programmers\nthat were good networking people.\nMost programmers don't even know what an IP address is.\nNow, if you're a programmer, you're probably saying you do.\nWell, good for you if you do,\n'cause I really haven't met it.\nSo we wanna know, I wanna know what your skill is\nbefore I add you to a team,\nbecause pushing out software,\ndeveloping software will require a programmer\nany network administrator.\nThe programmer is gonna be the guy\nthat programs the software.\nThe administrator works on the deployment team\nto deploy that particular software.\nWe wanna be able to deduce program project\nresource requirements.\nWe wanna be able to know\nwhat are those resource requirements\nthat's gonna be needed on this project.\nSo resource requirements is gonna be that task needs\nthese team members with these skillset,\nthat task over there need these particular skillset.\nSo for example, installing the server\nneeds a server administrator, needs a network administrator.\nProgramming the software may need a tester,\nmay need a particular coder\nthat knows a particular language.\nAfter we have done that,\nwe know the stakeholder skills, we put the team together.\nThen you have to continuously assess and refresh the skill,\nthe team skills to meet the project need.\nThis goes back to the previous tasks\nthat we talked about when we said, \"You know what?\nWe have to make sure we train them.\nWe have to consistently assess them.\"\nIf you find the team, let's say go to work one day\nand you see the team is in limbo,\nthey're not too sure how to do something.\nThere's a processes there,\nthere's tools there that they're not sure\nhow to get it done.\nYou have to intervene.\nYou have to say to them, \"Is there something I can do?\nDo you guys need more training?\nCan I go out and hire a consultant to help us out with this?\nShould I get somebody else?\"\nYou have to be very proactive.\nLet the team know you're there.\nConsistently assess them.\nAnd if you feel that you know what?\nHey, they don't have the right skill,\nthey don't have the right training,\nlet's go out and get it for them.\nMaintain the team.\nNow remember, in an agile project,\nyou wanna maintain that team.\nDon't change the team member.\nDuring the sprints,\nduring throughout building of that\nfrom that product backlog,\nwhat starts to happen, you change the velocity.\nDon't change the team on an agile project.\nTraditional projects that may happen,\nbut you still want to keep the team the same.\nWhen the project is over,\nyou wanna do a knowledge transfer,\nthe different phase of the project,\ncode it, test it, install it.\nYou're gonna be doing knowledge transfer\nfrom one team to the next.\nWhat was learned, errors and problems and bugs,\nthose fine during the testing\nshould then be transferred to the operation folks,\nso they know when they are installing it\nand maintaining it that, \"You know what?\nThere's a problem here.\nHere's how we fix it.\nThis was discovered during testing.\"\nSo we're gonna do a knowledge transfer.\nWe also here in PMP,\nwe also",
          "keyConcepts": [
            "agile",
            "training"
          ],
          "transcriptLines": {
            "start": 16401,
            "end": 16553
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d1t7",
          "taskNumber": "Task 7",
          "title": "Address and remove impediments, obstacles, and blockers for the team",
          "fullTitle": "Domain 1 Task 7: Address and remove impediments, obstacles, and blockers for the team",
          "content": "--- Domain 1 Task 7 ---\n\n-: In this video\nI'm gonna be taking a look at Domain 1: Task 7,\naddress and remove impediments,\nobstacles and blockers for the team.\nThat's a pretty long one,\nin terms of wording anyhow.\nOkay, so you're managing a project team.\nYou should in...\nyou should expect some kind of impediments,\nsome kind of blockers or\nor things that is causing the team issues.\nWhat are impediments?\nImpediments could be waiting on approvals\nso that the team can proceed.\nImpediments could be things like\nsuppliers are late on certain delivery.\nImpediments could even be the teams themselves.\nMaybe you have a team that\ndoesn't wanna follow agile projects,\nagile methods, even though the project sponsors\nsaid that's what they will\nthat's what they want the team to follow.\nImpediments are really obstacles,\nthings that blocks the team\nfrom completing the work.\nSo we want to be able to identify them.\nWe want to be able to see how we can resolve them\nand remove them,\nbasically is the idea here.\nLet's take a look at what it says here.\nSo it says, determine critical impediments,\nobstacles and blockers for the team.\nSo we're gonna wanna make sure\nwe know what those are.\nWe're gonna wanna make sure we understand\nwhere these impediments are coming from.\nWhat are these obstacles the team may facing?\nObstacle could be maybe the lack of training,\nmaybe the like I mentioned earlier,\nthe deliveries being late from the vendor.\nLack of participation from the product owner\nto prioritize the product backlog.\nLack of prior participation from the customers\nto inspect the products.\nLack of participation from the functional manager\nto give you the resources.\nThere's so many things that can cause problem\nor block a project from proceeding.\nWe have to determine what those things are.\nYou wanna prioritize these impediments, right?\nYou wanna prioritize these problems.\nSome are worse than others.\nFor example,\nif a vendor is consistently late,\nwell, that's a problem.\nBut if the organization is not allocating\nthe correct funds to proceed,\nthat's a major problem\nas a project may have to come to a stop.\nSo we have to be able to prioritize\nwhat these impediments are.\nYou wanna use network to implement solutions\nto remove impediments obstacles.\nUse when they say network,\nthey're talking about using\nall the people around you,\nusing all stakeholders and methods that you know how.\nIf you know the supplier's always late,\nmaybe it's time to find a new supplier\nof that particular product.\nIf you know\ngetting approvals can take a long time in the organization,\ntry to find a different path,\ntry to speak to other people within the company\nto see how these approvals can be faster\nso the project team isn't sitting around\ndoing nothing as they wait.\nSo use your network to find solutions\nto remove these impediments.\nEvery project is gonna be different.\nEvery organization is gonna be different.\nSo you're gonna have to find ways\nin every different business\nand every different project to do this.\nThen you wanna reassess continuously\nto ensure impediments, obstacles,\nand blockers are being addressed.\nThe nature of the work.\nRemove one,\nsomething else will pop up.\nThere's never a time on a project\nwhen there isn't some kind of problem going on\nand some kind of impediments or obstacles\naffecting the team.\nYou're gonna fix one\nand you're going to you\nyou best bet there's gonna be another one.\nSometimes you haven't fixed one\nand another one popped up\nor multiple is coming at the same time.\nReassess, and when you have fixed an impediment\nyou wanna make sure that you understand\nthat impediment is fixed and will not come back.\nBecause you may feel,\nokay, I fixed this impediment\nbut then you know what,\nit comes right back\nbecause the source of it wasn't addressed.\nSo really analyze what it is\nbefore actually going out\nand implementing a solution.\nDon't forget, once again,\nthe best solution will come from your team members.\nEngage your team members.\nDo all your inclusion tool,\nengage your stakeholders.\nFind ways, find different techniques\nto remove the impediments,\nthe obstacles and the blockers\nfrom the team.",
          "keyConcepts": [
            "agile",
            "training",
            "address",
            "remove",
            "impediments",
            "obstacles",
            "blockers"
          ],
          "transcriptLines": {
            "start": 16553,
            "end": 16676
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d1t8",
          "taskNumber": "Task 8",
          "title": "Negotiate project agreements",
          "fullTitle": "Domain 1 Task 8: Negotiate project agreements",
          "content": "--- Domain 1 Task 8 ---\n\n-: In this video, I'm gonna be talking Domain 1: Task 8.\nI'm gonna be talking about negotiate project agreements.\nNegotiation is a core skill that you must have\nas a project manager.\nYou're gonna be negotiating for team members\nfor particular supplies from suppliers or sellers.\nYou're gonna negotiate with functional managers\nfor those team members.\nYou're gonna negotiate with regulators\nto see how to implement certain regulation.\nYou're gonna negotiate with customers and product owners,\nfunctional managers, and senior management.\nYou're always negotiating even with team members\nto work on your project, even amongst team members\nyou're gonna be negotiating.\nNegotiating is a skill that you must possess.\nIt's a skill that you're gonna use throughout the day.\nNegotiations is just the way life works.\nIn fact, I had to negotiate a while ago\nto my wife to allow me to come and film these videos\nbecause she says I was spending\ntoo long in front of the camera recently\nas I was going through these videos.\nNegotiating is the part of life.\nLet's take a look at these tasks here.\nSo we're looking at, first thing we want to do\nis analyze the bounds of the negotiations for agreements.\nNow, up to what you can go right,\nthere has to be certain limits in negotiating.\nMaybe we can't spend a certain amount\nof money because then it doesn't make sense.\nSo maybe you're trying to do a project\nto build a software but the builders are saying,\n\"Oh, it's gonna cost $2 million,\"\nbut you have certain bound stuff,\nyou can only spend a million.\nSo there may be limitations within it.\nAnd this, you're gonna need to know\nbefore you go out and do the negotiation.\nYou wanna assess priorities\nand determine the ultimate objectives.\nWhat is it are you trying to get done?\nAre you trying to get a certain amount of work done\nin a certain amount of time at a certain amount of cost?\nYou have to know what exactly are your bounds?\nWhat exactly are your limitations?\nYou have to understand what is the priorities?\nAre you looking more to get cheaper work, faster work?\nYou want to get more quality work?\nYou have to know what your priorities are\nwhen doing negotiations.\nYou can't go to someone building a house and say,\n\"Well, I want a beautiful house for $100,000\n\"in an expensive neighborhood,\"\nyou're not gonna get much, right?\nYou have to know your priority then,\nif your priority was budgeting\nthen you're gonna realize that you know what?\nI may not get the best product.\nYou wanna verify the objectives\nof the project negotiations is met\nso you wanna make sure that after negotiating,\nyou know that you know what?\nWe have met what we were looking for.\nYou must participate in any kind\nof agreement negotiations with any kind of sellers.\nIt's just the nature of our work.\nWe are gonna be that center person\non all project negotiating.\nWe're probably gonna be held responsible\nfor the end results of the project.\nYou wanna determine a good negotiating strategy.\nYou wanna come up with a strategy\nthat'll work for your project.\nYou wanna come up with a strategy\nthat gets the project its correct objectives\nand those objectives are gonna be met.\nSo this is the task of negotiate project agreements.\nDon't forget, know your bounds,\nknow your limitations, know what you're looking for\nwhen you're doing negotiating.\nThen go out, negotiate, negotiate something\nthat's mutual beneficial to both parties.\nVerify that, you know what, this is what I was looking for.\nMake sure we participate in these negotiations.\nAnd we always wanna make sure the strategy\nwe're using is always beneficial to our project.",
          "keyConcepts": [
            "negotiate",
            "quality",
            "seller",
            "regulation",
            "agreements"
          ],
          "transcriptLines": {
            "start": 16676,
            "end": 16766
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t9",
          "taskNumber": "Task 9",
          "title": "Collaborate with stakeholders",
          "fullTitle": "Domain 1 Task 9: Collaborate with stakeholders",
          "content": "--- Domain 1 Task 9 ---\n\n-: In this video, we're gonna be talking\nabout Domain 1, Task 9, Collaborate with Stakeholders.\nCollaboration, if you haven't got it by now,\nproject management is all about collaborating with people.\nWhat exactly is a project?\nLet's review this.\nWhat is a project?\nA project is a set of people working together\nto accomplish a task.\nAccomplish a goal, maybe build something.\nWhat is a project?\nA set of people working together to build something.\nThat's not PMI's definition.\nOkay, that's just what a project is.\nAll right, don't memorize that one for the exam.\nLet's just say it's people\nworking together to build something.\nSo people working together to build something\nis collaborating.\nCollaboration, people have to collaborate.\nUnless you're the one person project,\nunless I hire you just to paint the room\nand you're just gonna paint the room,\nthen you don't have to collaborate.\nActually, you know what?\nI'm wrong.\nYou will have to collaborate\n'cause you're gonna have to buy the paint.\nYou're gonna have to collaborate\nwith the people selling the paint at the store.\nYou're gonna have to collaborate with the guy\nin the aisles that'll tell you\nwhat size of paintbrush to get.\nSo yes, you still need to collaborate\neven if you're the only one painting a room.\nCollaboration is critical to the success of any project.\nFailure to collaborate with stakeholders\ncan lead to customers not giving you requirements,\ncan lead to dissatisfied customers\ngetting things that they don't want or they didn't ask for.\nIt can lead to team members being upset with you\nbecause they're not sure what to do or have no directions.\nYou have to provide direction,\nyou have to provide that vision to that team.\nLet's take a look at what the slide has here.\nSo collaborate with stakeholders.\nSo what we're doing here, the first thing we wanna do\nis evaluate engagement needs with the stakeholder.\nNow, we covered this\nin the section of stakeholder management\nwhen we created that stakeholder management plan.\nDon't forget to review that section.\nSo evaluate engagement needs for your stakeholders.\nHow do we engage our stakeholder?\nWhy don't you sit at your desk one day and say, hmm,\nare we collaborating with these stakeholders?\nAre my customers involved on the project?\nIs my sponsor involved in this project?\nAre my team members engaging correctly?\nWhat can I do to engage them well?\nCan I hold more meetings?\nCan I hold more telephone calls?\nCan I hold more one-on-one discussions with them?\nWhat can we do to engage them?\nWe wanna optimize alignment between stakeholders' needs,\nexpectations, and project objective.\nThis is super important.\nLet me erase this and let's analyze what we need here.\nSo what is the stakeholders' needs\nand their expectations and the project objective?\nAre they aligned?\nWhat the stakeholder is looking for, what they're expecting,\nand what will the project produce?\nWe need to ask ourselves, are those in alignment?\nFor example, the stakeholder says,\nwe expect the room to be painted green.\nWell, is the project objective to paint the room green?\nWe have to see if those things are in alignment.\nThe accountant user says\nthey need an accountant software to have these fields\non an accountant report.\nWould the software you're programming,\ndoes it give them those fields on that report?\nThat would be optimizing alignment.\nYou wanna make sure that everything is aligned.\nThat way people know what this project is producing.\nYou wanna be able to build trust\nand influence stakeholders to accomplish project objectives.\nCollaboration will lead to trust.\nWhen people know what's happening on your project,\nwhen you're transparent, the more transparent you are,\nthe more trustworthy you are.\nThe more transparent you are,\nthe more people will have faith in what you're doing.\nIn order to build trust\nwe must collaborate and people has to be involved.\nThis will influence those stakeholders\nand this will help to accomplish the project objectives.\nOkay, so I don't think I need to go\nover this too much in depth.\nI think you understand collaboration is the key.\nNow, exam, when you get to the exam question,\nif there's a problem that needs to be resolved,\nyes, inclusive tool.\nOnce again, you guys gotta keep that in mind,\ninclusive tool.\nInclusive tools are tools that will make people collaborate,\nmake people communicate.\nThat's gonna be the answer to the exam questions.",
          "keyConcepts": [
            "collaborate",
            "stakeholders"
          ],
          "transcriptLines": {
            "start": 16766,
            "end": 16878
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t10",
          "taskNumber": "Task 10",
          "title": "Build shared understanding",
          "fullTitle": "Domain 1 Task 10: Build shared understanding",
          "content": "--- Domain 1 Task 10 ---\n\n-: In this video, we're gonna be taking a look\nat Domain 1:Task 10, build shared understanding.\nSo when working on a project\nit is super important to ensure\nthat everyone has a shared understanding\nof the goals of this project, when it will get done,\nhow it will get done, what will get done.\nYou have to understand that people's expectations\ncan lead to them creating issues\nor having issues with the project.\nFor example,\nI came and I told you I want you to paint the room\nbut I never really specify a particular color paint.\nBut then you go out and you paint the room green\nand now I don't like that.\nWell, there was some kind of misunderstanding\nthat happened when I told you to paint the room.\nThere was some kind of,\nmaybe I had some kind of expectation\nthat I thought you were gonna know,\nI wanted it blue because I always wear a blue shirt.\nDid you guys ever notice that?\nSo what happens is\nwe have to build that shared understanding\nand it's not something that you can assume\nthat people understand.\nThat's what this is about.\nLet's take a look.\nSo build shared understanding.\nWhat we wanna do is we wanna ensure\nthat we break down situations to identify the root cause\nof any misunderstanding.\nSo I wanted you to paint the room.\nI never specified a color.\nI assumed you always knew I liked blue.\nYou knew, you didn't realize that, you had green.\nWhat was the breakdown?\nWhat led to that root cause of misunderstanding?\nMaybe because I didn't give particular instructions.\nMaybe you had some kind of other assumptions\nthat you were gonna make.\nYou wanna eliminate these assumptions, right?\nYou wanna have to have a clear understanding.\nAnother thing you wanna do now,\nif it's some kind of a problem or issue on a project\nand you have to come to an understanding\nof what's happening.\nYou wanna survey all necessary parties\nto reach consensus on those particular things.\nYou're gonna wanna go out and talk to different people,\nto survey them, to have to understand\nwhat is it that they're looking for.\nMaybe you have many customers\nthat is giving you requirements to the project\nand whether it was one requirement\nwhere some people like\nand some people don't like,\nsurvey them, come up and find a consensus.\nOkay, you don't like this\nand you don't like it done this way,\nhow can we come to some kind of reasoning\nwhere we all understand what is it we're looking for?\nSupport the outcomes of parties in the agreement.\nThey're gonna be many parties\nthat may be in particular agreement.\nYou have to make sure that we support the outcome\nof what those agreements are.\nInvestigate potential misunderstanding.\nAnytime you have communications on a project,\nyou're gonna wanna make sure\nthat there's no misunderstanding.\nWhen you see two stakeholders talking,\ncould be two team members,\nteam member and a project manager,\nyou and a team member,\nyou have to ask yourself,\nis there any potential misunderstanding, was my,\nwas the communication clear?\nIf it's you to someone, ask yourself,\nwas my communication clear?\nWas there room for any misunderstanding?\nIf you remember from Agile\nwe talked about the Gulf of Evaluation.\nIf you guys remember that theory,\nin which case the way you describe something,\nthe way I'm describing it,\nis not the way you're hearing it.\nThen if you go describe it, it may,\nyou may describe it completely different.\nA message passed along from people,\nto people, to people will change.\nIf you take one message and pass it to 10 different people,\nby the time,\nat the end it'll never sound like the original message.\nWe have to ask ourself,\nthe message that's passed amongst all of our team members,\nis it clear?\nIs your message clear?\nDo they understand?\nThat's what this section is about.\nMisunderstanding on a project\ncan lead to a lot of conflict.\nMisunderstanding can lead to a lot of rework\nbecause we didn't get the requirements right.\nMisunderstanding can drive up\nthe escalation ladder of conflicts,\nlead into world war situations,\nremember that in Agile,\nwhere people want to kill each other\nbecause there's some kind of misunderstanding.\nBest thing to do, find the source of it,\nsurvey all participants,\nunderstand where this is coming from.\nFind the root cause of the misunderstanding.\nCome up with consensus,\nand ensure that everyone has a clear understanding\nof what this project could produce,\nwhen it'll produce it, and how it'll produce it,\nand pretty much how it'll cost.",
          "keyConcepts": [
            "communication",
            "agile",
            "shared",
            "understanding"
          ],
          "transcriptLines": {
            "start": 15177,
            "end": 15299
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t11",
          "taskNumber": "Task 11",
          "title": "Engage and support virtual teams",
          "fullTitle": "Domain 1 Task 11: Engage and support virtual teams",
          "content": "--- Domain 1 Task 11 ---\n\nAndrew: In this video, we're gonna be taking a look\nat Domain 1, Task 11, Engage and Support Virtual Teams.\nNow, virtual teams. You're probably working\non a virtual team right now.\nVirtual teams are pretty much the norm in today's society.\nIn Agile though, if you remember the chart we had looked at,\nwhere the most effective communication is face-to-face\nwith a whiteboard.\nWell, if you, if you understand that concept then\nyou're saying, 'Well, what happens now in virtual team?'\nWell, that's the difficult part,\nbecause we don't have the ability to do face-to-face\nwith a whiteboard.\nIn fact, you know, as I film these videos,\nwe do have a pandemic going on,\nand doing face-to-face is even--\nit's not safe to do that in a pandemic.\nSo, we must find ways to do other things\nlike having virtual teams and emul-- emulating\nor coming up with ways to best mimic\nthat face-to-face communication.\nAnd this is gonna be done virtually.\nWhen building a team space, for example on an agile project,\ngenerally we have circular desks,\nor desks where everybody can see each other.\nSo the question is how would we,\nhow would we do that in a virtual world?\nWell, I'm gonna give you guys some tips\non that in this section.\nWe wanna have clear crisp communications.\nPeople like looking at people.\nDid you guys know that?\nIf you guys notice this video format has changed.\nDid you notice at the beginning,\nall the PMBOK stuff was filmed with me being\nvery small in a little box somewhere on the left or right,\nand then you see these videos and you were like,\n'Hey, he changed. Now he's all big on the slide.\nAnd now I'm a full screen.'\nThat came after feedback.\nThe original set of videos were filmed when\nthe original class, when the original PMBOK was released.\nAnd then when the Agile was filmed earlier this year\nwe got a lot of feedback from students that says\n'Hey Andrew, we really like your videos.'\nAnd then I did a few videos where I put myself big\nin this big in the frame you saw in the Agile videos\nand people really liked it.\nSo then we came up with this format\nin this whole section now where you're seeing much more\nof me blended into the side and the more of me.\nWhy? Because people like looking at people.\nDid you guys ever know that?\nNever watched a movie with no people in it?\nYeah, that means you weren't watching a movie,\nyou were watching a wall.\nSo... we gotta watch each other.\nWe have to listen to each other.\nYou know why you guys like watching me?\nNow, I probably wasted a lot of time in that video,\nbuilding up to right now for a reason...because\nas you guys were watching me speak a few minutes ago\nabout how we film these videos, what was your reaction?\nWere you watching me directly?\nDid you notice the reaction on my face?\nThat's what we want out of this.\nVirtual teams.\nWe want to see people. We want to hear people.\nWe want things like digital meetings that is turned on 24-7.\nLet's take a look.\nSo the first thing we want to do is examine the\nvirtual team member needs.\nIn a virtual environment, you're gonna have to\nhave specific needs to help people collaborate.\nPeople come from different environments, countries, culture.\nIt could be spread across, across the globe.\nFor example, language may be very difficult to communicate,\nor very difficult to understand.\nIf people are on phone calls,\nthen it's gonna become even more difficult,\nespecially if they're not speaking your language correctly.\nI am a native English speaker if you haven't noticed,\nbut I do have an accent. At least so I was told.\nMy accent is of Caribbean. I come from a country\nin Guyana, in South America.\nBut a lot of people assume that I am from India,\nbut I'm not. I'm from Guyana and I have\na Caribbean accent, we call it.\nNow on the phone, I think I sound clear,\nbut some people say they can't really hear me.\nSo maybe we need clearer forms of communication.\nThese are things that you're gonna have to look into.\nYou're gonna have to see, okay,\nwhat is the team member needs on this?\nIs there alternatives?\nAny type of communication tools, or co-location\nor virtual co-location that we can use\nfor virtual team member engagement?\nImplement options for virtual team member engagement.\nZoom meetings are popular.\nZoom is not gonna be on your test,\nbut virtual meetings may be mentioned.\nThings like Zoom meetings,\nor GoTo Meetings will be implemented when trying to\ndo a virtual team.\nContinuously evaluate the effectiveness--\nand this is what you're gonna have to really do.\nYou're gonna really have to look at the effectiveness\nof these virtual team member engagement.\nIs it being effective?\nIs it not?\nIs our team members collaborating?\nIs it, are they not collaborating?\nWhat can we do to increase their collaboration?\nUh...\nHere, let's go through some things here that you\nshould know when doing virtual teams.\nNumber one, if you're doing virtual meetings,\nyou wanna make sure that it's always on.\nYou wanna simulate the environment of having a co-location.\nSo remember the ",
          "keyConcepts": [
            "communication",
            "agile",
            "virtual team",
            "engage"
          ],
          "transcriptLines": {
            "start": 15299,
            "end": 15463
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t12",
          "taskNumber": "Task 12",
          "title": "Define team ground rules",
          "fullTitle": "Domain 1 Task 12: Define team ground rules",
          "content": "--- Domain 1 Task 12 ---\n\n-: In this video\nI'm gonna be taking a look at Domain 1, Task 12:\nDefine team ground rules.\nNow remember something,\nteam ground rules was defined in the team charter.\nWe covered this in the resource section of this course,\nResource Management,\nProject Resource management.\nWe talked about this in plan resource management.\nSo remember what ground rules are.\nGround rules are the rules that the team is\nwilling to follow amongst each other\nsuch as no foul language, no insulting people based on race,\ndon't talk over people when people are speaking,\nwhen meetings turn off your phones.\nYou must have these ground rules in place on your projects.\nThis helps everything just to go\nby smoother and people should be aware of it.\nIt is not acceptable\nand people say now,\nbut at any point in time, it's never acceptable to make fun\nof someone for the way they speak,\nthe way they look, where they come from,\nand many other personal traits that people may have.\nNot because you speak a certain way,\ndoesn't make you less intelligent than others.\nSo you wanna make sure that these things are defined\nand people know them and the team agrees to them.\nSo we are gonna, we're gonna put these in that team charter.\nNow, the team charter,\nthe ground rules should be defined as early\nas possible by the team and for the team with your support.\nAs soon as the team comes together\nand you bring that team to start working,\nyou wanna make sure that you define these ground rules.\nLet's take a look at what the PMI wants us to know.\nSo the next thing up is to communicate\nthe organizational principles\nwith the team and external stakeholders.\nYou wanna make sure that the organization, first of all\nhas to have good ground rules.\nThe organization\nhas to come up with their own moral principles.\nThe organizational principles may be we do not discriminate\nagainst people's race, age, language, and so on.\nSo we wanna communicate that to the team and let them\nknow the organization does not tolerate any of this.\nYou wanna then establish an environment that foster adhesion\nto these ground rules.\nPreach the ground rules to them repeatedly.\nLet the team know that you know what the ground rules are.\nLet them know that this environment will not\nsupport these things.\nYou wanna make sure that they also understand that any type\nof violations will be punished.\nManage and rectify ground rule violation.\nLet's say you or one of your ground rules is we do not\nmake fun of the way someone speaks\nor pronounce certain words.\nIf you guys have noticed throughout this class,\nI don't pronounce words very well.\nI was born with a learning disability.\nI do stammer sometimes\nand my pronunciation of certain words,\neven though I'm a hundred percent English speaker\nI have never known any other language.\nBut it's not my people, it's not my,\nI shouldn't say my people,\nI should say my culture to mispronounce these words,\nit's just me and the way I think or the way I talk.\nBut you know what if there,\nif somebody makes fun of me for that, and believe me, I've,\nyou guys know I have thousands of students,\ntens of thousands of students and people I've had reviews\nor comments or people make fun of me or say\nI don't pronounce words correctly\nor I should choose another profession\nbecause I can't speak.\nOr I should learn English,\neven though that's the only language.\nPeople are very mean.\nI think you already know that though.\nIf you have a team where you have someone\nlike this and I'm one of the team members,\nand because I mispronounce certain words\nand those team members then\nyell at me or insult me for that,\nthis is something that you have to deal with.\nLet's say you're the project manager\nand Bob is insulting me.\nAndrew, you're not pronouncing that right.\nGo get out for this project\nbecause you don't know how to speak right.\nThat's something that you have to rectify.\nYou have to come out and say,\n\"Bob this is a violation of the ground rules.\nWe don't make insults against people's language.\"\nMaybe the first time you're gonna write 'em up,\nmaybe the first or maybe just a verbal warning.\nBob does it again to me,\nthe second time you're gonna write him up.\nYou're gonna say, \"Bob, I'm making a note of this.\nThis is not something that we support.\"\nAnytime we hurt people's personal feelings\nthat have a direct impact on the project.\nNow me and Bob can't communicate.\nNow you have conflict between two team members.\nThe first time, if you would've told Bob\nand he would've understood and he said sorry,\nthere would've probably been nothing out of it.\nSecond time, third time.\nBy the third time maybe Bob may need to be dismissed.\nNow on your exam,\nviolations for ground rules should be taken seriously.\nViolation of ground rules can even be illegal, especially\nif you are in a company, I shouldn't say illegal,\nmaybe by the land, but illegal, by a company standards,\nmaking fun of someone's race or something like that.\nThose may be causes for dismissal, not just\nfrom the actual project, but fr",
          "keyConcepts": [
            "team charter",
            "define",
            "ground"
          ],
          "transcriptLines": {
            "start": 15463,
            "end": 15600
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t13",
          "taskNumber": "Task 13",
          "title": "Mentor relevant stakeholders",
          "fullTitle": "Domain 1 Task 13: Mentor relevant stakeholders",
          "content": "--- Domain 1 Task 13 ---\n\n-: In this video,\nI'm gonna be talking about Task 13: Domain 1,\nMentor Relevant Stakeholders.\nMentorship, it's part about being a project manager,\nit's part about leading a team,\nit's part about being a parent,\nit's part about being a good friend,\nit's part of what we do in life.\nWe mentor, we help,\nwe try our best throughout life\nto help people that we know, or we care about, succeed.\nWhether that's a child, a team member, a boss,\nmentorship is all about guiding someone\nthrough a series of tasks\nin order to see them succeed in that particular task.\nWhen working on a project,\nit is really important to understand\nthat you're gonna have team members\nthat at some points may not be sure what to do.\nThey may be lost in their thoughts,\nor be lost in the work that they're getting done.\nThen you may have customers\nthat is not sure how to interact with the project,\nor sponsors that is not too sure\nof what the work is going on\nbecause they don't understand the complexity.\nIt is your job to mentor all your stakeholders,\nand whether that's your customer, or your sponsor,\nor your team members, doesn't matter.\nMentorship is what you're gonna do.\nIf you don't like helping people, mentoring people,\nyou're in the wrong profession.\nIf you don't like people, first of all,\nyou're in the wrong profession.\nMentorship and talking to people and engaging,\nhelping people is what we're gonna do.\nPMI says one thing we're gonna do\nwhen it comes to mentorship\nis we're gonna allocate the time to mentoring.\nMaybe there's a particular time of a week or a day\nwhere you dedicate to mentorship,\nto different stakeholders that need it.\nFor example, you may dedicate\nmaybe two hours every other day\nto mentoring a particular team member.\nNow, you gotta remember,\nit doesn't have to be mentorship\nfor the project management task,\nit could just be something personal in life.\nThe more they trust you,\nthe more they like to get along with you,\nthe better they will be.\nThe more motivated they will be.\nIf it's a particular task,\nand if it's a particular task that they need help with,\nor they're not sure how to navigate\na particular part of a project, you can help them.\nNow, of course, mentoring people\non something you don't know would be a disaster.\nFor example, if a programmer comes to you\nand wants you to mentor them on how to write codes\nin a particular language,\nand you're not a programmer,\nyou're probably not the right person to mentor them,\nbut what you're gonna wanna do\nis you're gonna wanna make sure\nthat you find the right person to mentor them\nso they can accomplish their task.\nYou wanna recognize and act on mentoring opportunities.\nThroughout your projects,\nthere's gonna be opportunities\nthat may present itself\nwhere you may look at that opportunity and say,\nnow is the right time for me to talk to them.\nFor example, there may be a big conflict on a project,\nand you can see the team is struggling\nto come up with a solution.\nThis is the perfect opportunity\nfor you to jump right in\nand mentor everyone on how we can make the solution.\nDon't choose it.\nDon't determine the solution.\nHow can we actually come up with a solution, right?\nThis is gonna be, that's my opportunity.\nThis is the time I'm gonna jump in\nso I can start mentoring them.\nI can't imagine a project\nthat the project manager doesn't mentor people.\nI can't imagine anyone in life not mentoring someone.\nWe all mentor someone in our lives,\nso as a project manager,\nlet's go out and look for the opportunities,\nallocate the right time,\nso we can provide mentorship\nto all the different stakeholders on our project.",
          "keyConcepts": [
            "mentoring",
            "mentor",
            "relevant",
            "stakeholders"
          ],
          "transcriptLines": {
            "start": 15600,
            "end": 15698
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d1t14",
          "taskNumber": "Task 14",
          "title": "Promote team performance through the application of emotional intelligence",
          "fullTitle": "Domain 1 Task 14: Promote team performance through the application of emotional intelligence",
          "content": "--- Domain 1 Task 14 ---\n\n-: In this video, I'm gonna be going over Domain 1: Task 14,\npromote team performance through the application\nof emotional intelligence.\nEmotional intelligence is a skill\nthat you probably already have,\nbut you gotta utilize it more,\nor maybe you're utilizing it enough.\nEmotional intelligence is basically the skill\nto know your own feeling,\nto know how you are responding to someone,\nand whether that's adequate, and to know their feeling,\nand how they are perceiving what you are telling them.\nEmotional intelligence is to look at somebody in their face\nand know how they're feeling.\nEmotional intelligence is to understand your own feeling,\nand to understand whether, hey,\nI'm being too harsh to you right now,\nso you better -- listen.\nThat's emotional intelligence.\nNow, I'm being too hard on you.\nOr I could say emotional intelligence\ncould be, now, I see in your face go back,\nwhat the hell is wrong with that guy?\nNow, I can see you go back, and I can see your reaction.\nI could literally see you through that camera,\nthat you're saying, this guy just went crazy,\nbut emotional intelligence is my ability\nto detect that I was very angry just now, emotional.\nBy the way, I'm not gonna do that anymore.\nYou don't have to turn volume down. (chuckles)\nEmotional intelligence is for me to look at you\nthrough this camera right now,\nand to see what your reaction is as I was saying that.\nWhen we talk to people, anytime we talk to people,\nyou can watch them in their face,\nand you could pretty much know\nif they're understanding what you're saying.\nSome people are, does this better than others.\nI have been told, based on the thousands\nof reviews I've gotten, that I'm a good teacher.\nYou know, I have thousands and thousands of reviews,\nand it's like 4.6 out of five stars.\nI think that's pretty good.\nCould get better, but I think that's pretty good.\nAs an instructor, and I do a lot of classroom training,\nas well as online training,\neven when I'm doing online training, live online training,\nI tell my students, hey, put your camera on if you want to.\nI'd love to...\nAnd they don't know why I tell them that.\nThey may think it's not useful, but it's useful to me,\nbecause when I'm talking to them,\nthey'll be able, I'm able to tell\nwhat I'm getting through to them.\nI can look, I can look at people and determine\nwhether what I'm saying, they're getting it,\nor they're understanding it.\nThings like watching their heads nod,\nthe look in their eyes, I could see that,\ntheir expression on their face that they understand that,\nthat what I'm telling them,\nand then I personally know what my response is.\nAm I being too harsh?\nAm I going too fast?\nAm I going too slow?\nAm I speaking loud enough?\nAm I angry?\nAm I not angry?\nAm I tired?\nAnd sometimes I'm tired.\nMaybe there were videos, when I was in some of these videos,\nyou guys were probably saying, hey,\nthis guy looks pretty tired, and maybe I was.\nSome of these videos were filmed\nafter me conducting an all-day class,\nand then going into the studio in school here,\nlike this is a big studio here at TIA, now.\nThat's why, by the way, if you see the film changed,\nall now you see is big studio we have now\nwhere we do these courses.\nSo, it's me to know these things.\nI think emotional intelligence is a really important skill\nthat we need to have personally on projects, obviously,\nbut also throughout life.\nIt will help you through all of it.\nNow, you can build these skills, not by taking this class.\nThis is not a class on that.\nThis is a class on knowing, hey,\nyou need to have emotional intelligence.\nSo according to PMBOK, here, we need to assess the behavior\nthrough the use of personality indicators.\nIf when we're talking to people,\nwe need to know what are the indicators\nthat these people are having discussion.\nWhen you're talking to somebody\nhaving some kind of issue with you,\nor not understanding you, or some kind of misunderstanding.\nEmotional intelligence will help you do this.\nAnalyze personality indicators,\nand adjust to the emotional needs\nof key project stakeholders.\nSo you're talking to someone,\nyou're communicating with a key stakeholder,\nand you can look in their face, and you can say,\njust like how I can look at my students,\nand you guys are my key stakeholders.\nI can look at at the sponsor or my students in the face,\nand I could tell they're not understanding me.\nThey're not with me.\nTheir mind is somewhere else.\nThey may be angry with me, they may be happy with me.\nYou have to be able to tell,\nand then you have to adjust what you're saying.\nYou have to maybe calm yourself down.\nMaybe you are, you know, if I'm upset,\nyou're gonna be upset.\nIf I'm happy, you're probably gonna be happy.\nRemember, a guy who's laughing,\neverybody starts to laugh, right?\nMaybe then we need to change the way we're talking,\nor facial expression in order to meet\nthe stakeholder's needs.\nNow, let's get to your exam.\nWe just talked a lot about emotional intelligence,\nbecause I think this is gonn",
          "keyConcepts": [
            "team performance",
            "training",
            "emotional intelligence",
            "promote",
            "performance",
            "through",
            "application",
            "intelligence"
          ],
          "transcriptLines": {
            "start": 15698,
            "end": 15843
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        }
      ]
    },
    {
      "id": "domain2",
      "name": "Process",
      "examWeight": 41,
      "description": "The technical aspects of managing projects",
      "taskCount": 17,
      "tasks": [
        {
          "id": "d2t1",
          "taskNumber": "Task 1",
          "title": "Execute project with the urgency required to deliver business value",
          "fullTitle": "Domain 2 Task 1: Execute project with the urgency required to deliver business value",
          "content": "--- Domain 2 Task 1 ---\n\n-: In this video, I'm gonna be taking a look\nat domain two, task one,\nexecute project with urgency\nrequired to deliver business value.\nLet's get into it.\nSo, when a project is finished planning,\nthe next step is of course, to execute that plan,\nand to start the work.\nAnd if you're working on a traditional project,\nyou know when you execute, you're basically executing\nto build the entire deliverable in one shot.\nIf you're doing an Agile project,\nyou're basically executing that iteration\nto build an increment of the product.\nNow, we know that using Agile projects\nleads to value being more realized, more upfront,\nand value coming earlier and faster to the customer\ngenerally makes them more happy.\nBut remember, this is not always the case.\nIt's not always you can deliver a part of the product.\nIf you're building a large skyscraper, you can't say,\n\"Oh, here's three stories,\nmove in while I build the other 20.\"\nSo it may not be possible,\nbut you should look for opportunities\nto actually build things in increment if it's possible.\nAs the project work is getting done,\nand as they're actually building the product,\nyou gotta ask yourself,\n\"Is this project still delivering value\nto the stakeholders?\"\nMaybe they were looking for decrease of expense\nor increase of revenue based on this project,\nand you have to keep assessing,\n\"Is the project still delivering those particular things?\"\nThen the next thing you wanna do is make sure to subdivide,\nsupport the team to subdivide tasks\nto find what is called MVPs or minimum viable products.\nSo let's take a look at what I have here.\nI just went over most of it.\nWhen the project execute, ask yourself,\n\"Is there opportunities\nto deliver this product in increments?\"\nMaybe there is, maybe there is not, right?\nSo, in software development projects,\nbecause you can use a piece of a software\nand not have the other components ready,\nit may be just fine as the other components are being built.\nIn a situation like that, it's okay,\nbut in a car, if you're building a car,\nyou can't build just a chassis\nwith no engine and say, \"Well, drive.\"\nSo, it may not be feasible to build an entire thing,\nsomething usable.\nBut you know what?\nIf you're building a car, maybe you can decrease the plan\nand the execution and build them in smaller increments\nwhile getting more feedback.\nSo you're following a traditional project,\nbut you're building it,\nit's not really an iteration.\nIt may last six months and then get some feedback,\nlast six months and then get some feedback.\nThis is a hybrid approach.\nSo try to look for opportunities.\nAlways say to yourself,\n\"Is there a way to break this work down,\nand to get feedback as we're doing it?\"\nYour exam will push this a lot.\nMake sure you look for opportunities for that.\nI do anticipate a question on your exam\nwhen they're gonna say,\n\"The customers weren't satisfied,\nthe customer didn't give any inputs and what was-\",\nthe answer would be something like,\nthe project manager should break the work down,\nand allow more inputs using its smaller increments.\nTrust me on that, that'd be a real question.\nExamine the business value throughout the project.\nIs the project still delivering value?\nAs the project is progressing,\nas it's being executed, are we still delivering value?\nIs the customers still getting what they're getting?\nGet that from the assessment.\nSupport the team to subdivide project tasks as necessary\nto find the minimum viable products.\nSo what we want to do,\nis we want to look at the project task, break them down,\nand find MVPs, minimum viable product.\nNow remember we covered this in Agile.\nAn MVP, a minimum viable product,\nis a product that is functional, usable,\nbut doesn't have a lot of features.\nIt's a bare minimum to give the customers,\nso they can try it out, they can use it out,\nthey can give you their feedback.\nIt's not gonna have all the bells and whistles.\nThink of it as buying a base model car.\nIt's not gonna have all the bells and whistles,\nbut it'll drive and you'll get a good feeling\nfor whether this car is something you want or not.\nSo a minimum viable product gives you a lot of feedback.\nI do expect the minimum viable product\nto be a question on your exam.\nOr to use it.\nMaybe it'll be the answer to a particular question,\nis to use the minimum viable product,\nmaybe to get more customer feedback.\nOkay, so exam, once again, when a project executes,\nlook for opportunities to see how we could deliver things\nin increments versus over a long period of time.\nThat way you can get more feedback.\nReexamine your execution\nto make sure you're always delivering value.\nAnd always try if you could to use a minimum viable product.",
          "keyConcepts": [
            "agile",
            "business value",
            "execute",
            "urgency",
            "required",
            "deliver"
          ],
          "transcriptLines": {
            "start": 16878,
            "end": 16996
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d2t2",
          "taskNumber": "Task 2",
          "title": "Manage communications",
          "fullTitle": "Domain 2 Task 2: Manage communications",
          "content": "--- Domain 2 Task 2 ---\n\n-: In this video, I'm gonna be going over Domain 2, Task 2.\nWe're looking at manage communications.\nNow this one,\nmanage communication sounds exactly as you would have\nin project communications management, right?\nThat whole knowledge area,\nand this is basically what this is.\nBefore I move on, I do wanna point out\nthat these processes, this section, this Domain 2\nreally relates to the PMBOK guide.\nIt really goes through all the PMBOK process.\nSo consider this a review of this entire,\nwe're gonna be basically reviewing\nthat entire knowledge area.\nSo let's get started.\nI'm assuming you read this knowledge area already, right?\nYou're ready to watch videos on it.\nSo what is the single most important aspect\nof a successful project?\nIn my mind, communication.\nIt is said that 90% of what we do as a project manager\nis communicating.\nWe communicate with our sponsors,\nwith our customers, our team members, our suppliers,\nsenior management, regulators, and many others.\nSo communication is gonna be key to a successful project,\nand in the process, let's get into this,\nin the process of plan communication management,\nwe created the communication management plan.\nIn that plan, we had to analyze\nwhat was the needs of the stakeholders?\nTo create that, we had to analyze\nthe communication needs of the stakeholders.\nHow would they have liked?\nWhat would they have liked?\nSo what type of communication?\nWhen would they need it?\nWhat's gonna be stored in it?\nWho's gonna give it to them?\nHow often you gotta give it to them.\nNow remember to review that section.\nSo we stored this, we analyzed this,\nand we stored this in a communication management plan.\nWe gotta define what methods are used.\nHow they want meetings.\nHey, the CEO don't want no meeting.\nYou know what she wants?\nShe wants a written email\nthat is no more than a paragraph long,\njust on the status of the project.\nThe sponsor wants a detailed meeting every other Friday.\nWhat method works for them?\nRemember the channel frequency.\nWe did the communication channels formula.\nUse that formula to determine\nhow many different stakeholders\nand how many different\npotential channels of communication you may have\nbetween Bob and Jane, Jane and Mary, between Bob and Mary,\nand what level of detail are they looking for?\nLike I mentioned, the CEO, she only wants that high level,\nshe only wants that high level email every other week\nversus the sponsor wants a more detailed one.\nFor the team members, communication should be detailed\nbecause they're actually building the product.\nThey should be doing their daily standup meetings.\nThe next thing\nis communicate project information and updates effectively.\nWe have to ask ourselves,\nwhen we are communicating project information,\nare we doing this effectively?\nIs it actually effectively, is it actually...\nIs it actually being understood?\nIs the report that I give the CEO, is she happy with it?\nIs even the frequency enough?\nMaybe two weeks is too far apart, or maybe that's too much.\nYou have to know what's best for your stakeholders.\nWhen communication is given,\nconfirm that it's understood and feedback is received.\nMaybe when you give out certain forms of communication,\nyou may quiz people.\nYou may go back and, \"Hey, did you understand that?\nDid you get that?\nDo you have any other particular questions\nthat you can get answered?\"\nThis would be, hey, that you know what?\nThe communication's received.\nIt's understood.\nIf they can answer your question,\nmaybe they have understood every part about it.\nCommunication, without a doubt, on any project\nis super important\nto ensure that your project is successful.\nAnalyze what communication is needed\nby all stakeholders on your project.\nRemember, we did identify stakeholders.\nWe knew who they were.\nThen we took the stakeholder register.\nWe went to plan communications.\nWe determined the communication needs.\nWe looked at what method they wanted.\nWe analyzed our communication channel.\nWe had to make sure we communicate\nproject information and updates effectively,\nwhether that was using meetings,\nthat was using our personal skills,\nusing our emotional intelligence,\nusing our presentation skills.\nWe had to communicate this thing effectively\nto make sure stakeholders\nwas actually understanding what we were communicating,\nand of course, they had to try to get feedback.\nThat way,\nyou know that they're understanding your communications.",
          "keyConcepts": [
            "communication",
            "emotional intelligence",
            "communications"
          ],
          "transcriptLines": {
            "start": 17843,
            "end": 17960
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t3",
          "taskNumber": "Task 3",
          "title": "Assess and manage risks",
          "fullTitle": "Domain 2 Task 3: Assess and manage risks",
          "content": "--- Domain 2 Task 3 ---\n\n-: In this video, I'm gonna be talking\nabout Domain Two, Task Three:\n\"Assess and Manage Risks.\"\nNow, this particular task\nexclusively deals with the knowledge area\nof project risk management, right?\nYou guys should remember that from earlier videos.\nNow, if you- just a quick review of that knowledge area.\nWe had to plan risk management,\nwe identified a risk to get our risk register,\nwe did our qualitative, our quantitative,\nwe did our risk responses,\nand then we did our implement the risk response, if needed,\nmaybe during execution process where there was a risk.\nAnd then we monitor our risk- monitor our risks.\nSo those are the processes.\nHopefully you guys remember that.\nSo let's talk about this here.\nLet's start out, once again, by saying,\nI probably said this earlier in the course,\neverything we do in life has risks.\nEverything we do in life has risks.\nAnd we wanna be able to identify these risks.\nEvery action has a risk,\nbe it positive or negative.\nMe standing here has a risk.\nThe ceiling can fall down.\nThe desk can collapse.\nThe camera can- battery can die like it did\nbecause he forgot to plug it in earlier.\nAnd there was a risk.\nAnd the risk was I was gonna record something\nand after a six minute video, the camera died.\nI didn't get to end it, so I have to do it again.\nThere is a risk of that\nas he's laughing at me in the corner over there now.\nSo risk is everywhere in your life.\nRisk is everywhere in your project.\nAs part of being a good project manager,\nyou're gonna have to assess and manage your risks.\nYou're gonna have to identify the risks.\nWhat risks can affect your project?\nCan you remember where to store those risks\nonce you identify them?\nIf you said the risk register, you are correct.\nYou wanna determine how,\n\"What is the best way to do your risk management options?\"\nThen, you \"determine risk management options.\"\nThat's gonna be knowing how to do your qualitative analysis,\nknowing how to do your quantitative analysis,\nand then coming up with those risk responses\nis gonna be important.\nThose risk responses,\nthings like knowing when to use a mitigation,\na transfer, an acceptance,\nknowing when a positive risk and opportunity\nthat presents itself.\nWhen do we take advantage or enhance\nor share that opportunity or accept it?\nSo we're gonna have to know which one of those\nmakes sense for what risk.\nYou wanna always \"iteratively assess and prioritize risk.\"\nThis means do over,\nover and over and over.\nAlways reassess in risk.\nYou've gotta remember how- what happens with risks.\nYou may have a risk that's very low right now.\nFor example, getting the flu in the summertime is low.\nBut after you've reassess it over and over,\nas the weather gets colder here in New York City,\nit goes up drastically.\nIn the wintertime, it's much higher.\nSo the risk went from being low priority to a high priority.\nSo we want to consistently keep reassessing risk.\nThe service being late on a project,\ndelivery being late,\nat the beginning, it's not so critical.\nWe could still use some test machines and things like that.\nBut as this project is progressing,\nthen you know what?\nIf those servers are gonna be late,\nit's gonna affect the implementation\nor the schedule on implementations.\nSo that risk gets higher priority.\nSo throughout the project, your risk will change.\nCertain risks may get less and more.\nCertain risks, it'll go from high priority, low priority.\nOr maybe it'll go from high to low or low to high.\nWho knows?\nIt depends on the risk, depends on the project.\nThat's why you want to keep assessing it.\nNot to mention there's new risk every day.\nEvery single day we wake up,\nthere's a new risk that can take our lives.\nThere's a new risk that can derail your project.\nThere's probably a new regulation risk.\nThat's why we wanna keep assessing these things.\nSo managing a project,\ndefinitely risk management is gonna be something\nthat's at the top of your mind.\nIt's something you're gonna be thinking about all the time\nbecause risk changes consistently,\nand you have to keep reassessing\nso you know how to respond to these risks appropriately.\nIf not, it can have really bad effects on your project.",
          "keyConcepts": [
            "risk",
            "regulation",
            "assess"
          ],
          "transcriptLines": {
            "start": 17960,
            "end": 18068
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t4",
          "taskNumber": "Task 4",
          "title": "Engage stakeholders",
          "fullTitle": "Domain 2 Task 4: Engage stakeholders",
          "content": "--- Domain 2 Task 4 ---\n\n-: In this video, I'm gonna be talking\nabout Domain 2, Task 4, Engage Stakeholders.\nSo this particular task maps back to the\npart of the course where we did stakeholders' engagement,\nmanage stakeholders engagement.\nSo that particular knowledge here\nis what we're covering here.\nSo if you guys remember the process.\nDo you guys remember the process?\nYou had identify stakeholders,\nplan stakeholders' engagement,\nmanage stakeholders' engagement,\nmonitor stakeholders' engagement.\nSo hopefully you guys remember your process.\nHopefully I got 'em right too.\nWas it monitor or was it control?\nI was confused on that.\nI'm gonna let you guys look that up.\nOkay, so let's get into this.\nWe gotta keep our stakeholders engaged.\nWe talked about this in that section.\nWe have to know what our stakeholders are looking for.\nWhat influence level they're gonna have,\nwhat interest they're gonna have,\nwhat impact they're gonna have on our stakeholders.\nThen we can categorize them.\nWe can categorize them based on their interest level,\nbased on their impact of the project.\nWe gotta then engage them based on these categories.\nMaybe we can even go in and say,\n\"Sponsor, customers, team members.\"\nThe way we engage 'em is gonna be vastly different\nfor the entire project.\nThen we wanna come up a strategy to ensure\nthat they're engaged and stayed engaged on your project.\nSo let's take a look here at our engagement section.\nNow, here we go.\nSo engaging our stakeholders.\nNow, once again, you're gonna want to make sure\nthat you review that section.\nPlan stakeholder management, and let's take a look.\nSo the first thing we wanna do is analyze\nthe stakeholders.\nNow, we went over this in that section.\nWe talked about using a power interest grid, an influence.\nAnd if you remember influencing, an impact,\nif you guys remember, there's vertical,\nthere's horizontal, there's side by side.\nSo vertical would be people that be on top of you\nlike senior management.\nSide by side, you can be things like functional managers.\nBelow you can be like team members.\nAnd then what influence?\nSenior management may have a large, large influence\non your project versus somebody like a customer\nmay have good influence on the project requirements,\nbut the ultimate decision-making,\ntheir influence will come from the sponsor.\nIf it's an agile project, there's a lot of influence\nfrom those particular customers or the product owner.\nCategorize your stakeholders and engage them by category.\nCategorize your stakeholder based on impact,\nbased on, you can even do 'em by types,\ncustomers, senior management and so on.\nThen you wanna make sure you develop, execute,\nand validate a strategy for stakeholders engagement.\nYou wanna come up with a strategy that says,\n\"Hey, this is how we are going to keep them engaged.\nWe're gonna do these types of meetings,\nthese types of face-to-face discussion,\nthese types of virtual meetings, these kinds of emails.\"\nWe're gonna then execute it,\nand we're gonna validate that the strategy actually works.\nRemember, we execute it in the process\nof managed stakeholder and then\nwe start to monitor, control it.\nIn that process, then you're validating,\n\"Hey, is the strategy working?\"\nI mentioned in that section,\nand I mentioned it again,\nengagement of your stakeholders,\nprobably the single most important ingredient\nwhen it comes to,\nbecause this goes with communications, right?\nRemember, this utilizes communications also.\nThese two things, communicating and engaging\nyour stakeholders is gonna keep\nyour stakeholders interested in your project,\nis gonna keep the stakeholders knowledgeable\nabout what's happening in your project.\nSo this is where this becomes super important.\nThis is where this becomes important\nto understand what they're looking for,\nhow to keep him interested.\nAlways remember this.\nIf your stakeholders are not engaged on your project,\nthere's a problem.\nIt means that they're losing interest.\nFind ways to bring 'em back.\nOkay, engagement, we know is important.\nBring it together with communications.\nEnsure your stakeholders are being engaged,\n'cause if not, and they're losing interest,\nyour project can go bad really fast.",
          "keyConcepts": [
            "communication",
            "agile",
            "engage",
            "stakeholders"
          ],
          "transcriptLines": {
            "start": 18068,
            "end": 18175
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t5",
          "taskNumber": "Task 5",
          "title": "Plan and manage budget and resources",
          "fullTitle": "Domain 2 Task 5: Plan and manage budget and resources",
          "content": "--- Domain 2 Task 5 ---\n\n-: In this video, I'm going to be talking\nabout domain two task five,\nplan and manage budget and resources.\nNow, this particular task comes right out of PMBOK,\nwhere we're going to look at plan cost management.\nCan you guys remember what those processes were?\nWe had to estimate the cost, determine the budget,\nand then control our budget or control our costs.\nSo this is where you learn about all those EVM formulas.\nHopefully you found those videos to be very useful,\nand you really reviewed them and know your EVM formula,\nbecause in this section\nwe're basically going to be reviewing that.\nSo every project is going to have some kind of budget.\nIt's going to be on us as the project manager\nto ensure that we manage this budget accordingly.\nWe estimate how much it would cost,\nwe know what the project would cost when it gets executed,\nwe try to utilize the most subject matter experts.\nThis would be things like doing a bottom-up estimation\nversus doing a top-down estimation,\ngetting estimates from subject matter experts\nexpert judgment and so on,\nto make sure that we do the right estimation,\nmaybe even from previous projects that we learn.\nAnd then getting your budget approved,\nexecuting the project, anticipating any type\nof budget challenges or problems you may have,\nmaybe by going over your budget\nthen monitoring it with those EVM formulas.\nSo let's take a look here\nat what they want us to know from an exam perspective.\nSo here we go in task five,\nand we want to be able to estimate budget needs\nbased on the scope of the project\nand lessons learned from the project.\nSo we want to be able to know, okay, what is,\nhow much money I should say is needed for this scope,\nand based on how long, we're probably wanting\nto get it done.\nNow where do we get our budgets number from?\nYou get them from lesson learned from previous projects.\nThe previous time we painted this room,\nwe spent $500 doing it.\nWell, how much is it going to cost to paint a room\nof similar size?\n$500.\nSo we want to make sure that we get those lesson learned\nfrom previous projects, because this is really going to help\nto make the accuracy of the budget.\nDon't forget using something that's a bottom-up,\nan expert judgment, those are basically experts,\nthey're expert because they've done it before.\nSo they're getting it\nfrom previous projects that they have probably worked on.\nAnticipate future budget challenges.\nWe want to be able to know, okay, when the project executes,\nis there a possibility that we can go over the budget?\nMaybe we can go over, maybe we can end up with a CPI\nof 0.9, 10% over our budget.\nSo we want to be able to anticipate\nthose future budget challenges,\nand that's why we're going to build them into reserves.\nRemember, we can add in contingency reserves\ninto our project, not management, contingency reserves\ninto our project.\nWhen the project executes,\nyou want to monitor the budget variations\nand work with governance process to adjust as necessary.\nWhen the project executes, run your EVM formula.\nWatch to see if you're going off budget.\nIf you're going off of budget,\nthe next step to do would be to go back\nand get more funding, or adjust the work as needed,\nimplement the change request to adjust the project\nto make sure that you acquire the right budget.\nAlways look for ways,\nand always try to be predictive in nature.\nLook for preventive measures,\nso that you don't go off budget.\nPlan and manage those resources accordingly.\nMake sure resources are utilized correctly\nin a cost effective way.\nPhysical resources, or resources that are used up\nlike paint or machinery and things like that.\nYou want to use them efficiently\nso you don't drive up the budget more than anticipated.\nManaging a project budget is a,\nproject management course 101 thing.\nEvery project manager will manage budget.\nIt's just part of the work.\nIt's what we do.\nWe always have to make sure we plan for the budget,\nand know, when we went to the boss\nand he asked how much money we needed.\nWhen the project executes\nwe want to make sure the project stays on budget.\nAnd that's really what this is about.\nPlan it, estimate it, know how much it's going to cost\nwhen the project executes, try to stay on it.\nIf there's any kind of variations,\ngo out and implement the right change request, fix it,\ntry to bring the project back on budget.\nAlways try to end your project on budget.",
          "keyConcepts": [
            "change request",
            "scope",
            "governance",
            "budget",
            "resources"
          ],
          "transcriptLines": {
            "start": 18175,
            "end": 18282
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t6",
          "taskNumber": "Task 6",
          "title": "Plan and manage schedule",
          "fullTitle": "Domain 2 Task 6: Plan and manage schedule",
          "content": "--- Domain 2 Task 6 ---\n\n-: In this video, I'm gonna be talking\nabout Domain 2: Task 6, plan and manage schedule.\nNow this particular set,\nthis particular task and set of enablers\ncomes from the section of plan schedule management,\nif you remember that from the earlier part in the class.\nThis is when we covered things, that critical path method\nthat big section on that,\nso can you guys remember the processes there?\nWe had plan schedule management,\nwe had to define those activities.\nWe sequenced the activities,\nwe estimated the activity duration,\nwe developed the schedule,\nand then we actually monitor and control the schedule.\nSo those were the processes that we had to remember\nfrom that section so let's just do a quick review.\nSo the first thing you wanted to do,\nwas to come up with your scheduling method.\nHow are you gonna do the schedule?\nHow are you gonna define those activities?\nHow are you going to keep the project on schedule?\nThat was done in schedule management plan.\nThen we define the activities, right?\nThen we know we broke down those work packages.\nRemember, work packages are broken down\nto schedule activities.\nWe basically know, okay, those activities\nis to go to the store, buy the paint, come back,\npaint a wall, so we know what those activities was.\nWhen we are doing scheduling though,\nwe have to sequence them.\nWe put them in order and we do this, then we do this,\nthat's that critical path.\nWe also have to then determine\nhow long it'll take to do those activities.\nEach activity had to be assigned a duration,\nthe best way to do that was to use bottom up\nor expert judgment or something like that.\nThe next one after that we'll do\nis to build their schedule and put them in order,\nput the entire schedule up.\nUse some kind of scheduling methodology like a CPM\nmaybe even Agile schedule in order to build their schedule.\nSo once we come up with a schedule\nwe go execute the project\nand we wanna make sure that we keep the project on schedule.\nWe wanna make sure that we keep an eye on the schedule\nto know if we're going over, maybe we're taking too long\non a particular activity or task that we didn't anticipate.\nLet's take a look at what the task here is.\nSo the first thing up,\nis we want to be able to estimate the project tasks.\nWe wanna know what those tasks are.\nNow, I know in the \"PMBOK Guide\",\nthey use the word activity.\nIn this examination content outline, they use the word task,\nthey're basically gonna be the same thing.\nThe reason why there's a difference in terminology\nis because remember now the PMP Exam\nis not just based on PMBOK,\nit's based on \"The Agile Practitioner Guide\"\nand eight other resources.\nIt's PMBOK, \"Agile Practitioner Guide\" and other things\nbut they could still use the word activity.\nSo anytime you say the word task, think of activities, okay?\nTo estimate what those things are,\nthe milestone dependencies, the story points.\nSo we're gonna have to take a look\nat each individual task or activity\nand we're gonna have to estimate a particular duration.\nNow in traditional projects,\nwe're gonna assign a particular timer to it.\nWe're gonna say that activity is three days.\nBut if you remember, in Agile projects, we don't do that.\nWe use story points, right?\nWe use the Fibonacci Sequence\nand we assign two, three, five, eight,\n13, 20, 21, and so on and so on number of points\nto each individual story that it's a relative system\nto see how big that story is.\nLooking at the dependencies,\nthis is where you're gonna build\nyour project schedule, network diagram.\nThis is where you're gonna build that diagram\nand you're gonna say, do this, then do this.\nRemember, start to start, finish to finish,\nall the different dependencies.\nNow, when you're doing your schedule and you're determining\nhow long it will take to do something,\nutilize benchmarks and historical data.\nBenchmarks is like industry standard,\nso if painting a room is industry standard,\nlike this room it's a one day thing,\nthen benchmark it at one day.\nIf building a whole new product\ngenerally takes up to one year,\nthen it'll probably take one year\nto do this new phone product.\nHistorical data, we're gonna use a lot of historical data\nwhen estimate in time.\nIt's just part of the work,\nit's part of what we're gonna do.\nThen we gotta prepare a schedule based on a methodology\nand measure the ongoing process against it.\nWhat method are we gonna use to develop a schedule?\nAre we're gonna use Agile methods?\nCan we use CPM methods?\nYou have to come up with some kind of method\nthat fits the actual characteristics of the project.\nThe team members, we wanna prepare the schedule\nbased on this thing.\nWe wanna measure it based on these methods.\nThe next thing you wanna do\nis modify the schedule as needed based on this methodology.\nWhen the project is executed,\nany changes to it on a traditional project\nis going to change request.\nAgile projects doesn't have such a schedule,\nthey have a fixed schedule that they're trying\nto get as much work done as possi",
          "keyConcepts": [
            "agile",
            "change request",
            "schedule"
          ],
          "transcriptLines": {
            "start": 18282,
            "end": 18454
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t7",
          "taskNumber": "Task 7",
          "title": "Plan and manage quality of products/deliverables",
          "fullTitle": "Domain 2 Task 7: Plan and manage quality of products/deliverables",
          "content": "--- Domain 2 Task 7 ---\n\n-: In this video,\nI'm gonna be talking about Task 7, Domain 2: Task 7,\nPlan and Manage Quality of Products/Deliverables.\nSo let's get started.\nWhen managing any project in any environment\nit doesn't matter what it is, you're gonna have to ensure\nthat your deliverable meets the quality requirements.\nRemember something,\nquality has a direct impact on customer satisfaction.\nIf the customers are not satisfied with the products\nthen you're asking for failure from the start.\nSo we have to make sure\nthat we gather those quality requirements.\nCan you remember what process we did that in?\nDid you say collect requirements?\nThat's correct.\nWhere do we store these quality requirements?\nWe store those in the requirements documentation.\nNow I do wanna point out that basically this section\ndeals with plan quality management,\njust as you would have in PMBOK.\nSo this particular task\ndeals directly with quality management.\nNow we're gonna wanna make sure\nthat we get those quality requirements\nand we collect those quality requirements\nin the process of collect requirements.\nThen when we get to the process of plan quality,\nthen we're gonna come up with a quality management plan.\nWe're gonna say, this is how the project is gonna implement\nor this is the task we're gonna be taking\nto implement the quality requirements\nto ensure that our deliverables\nmeet those particular quality requirements.\nSo that's gonna be the objectives of this particular,\nof this particular task.\nLet's take a look.\nSo let's go into this.\nSo the first thing up is,\ndetermine the quality standards required\nfor the project deliverables.\nWhere are we gonna get those standards?\nWe're gonna get those standards\nfrom talking to the stakeholders.\nWe're gonna get them from talking to the individual,\nnot just the stakeholders, but also talking\nto senior management, talking to the sponsors.\nWhen I say stakeholders, better, I was thinking customers.\nSo you wanna make sure you talk to the right people\nto ensure that you gather the right quality standards.\nRemember, quality requirements can be how fast it responds.\nIt could be what type of paint color you're using,\nnot just white paint,\nbut maybe you want a glossy white paint.\nSo gather those quality requirements, know what they are.\nThen you're gonna recommend options for improvement\nbased on quality gaps.\nIf the product that's being developed\nis not meeting its requirements,\nmaybe it's, I'm talking quality requirements,\nif the product being developed\nis not meeting those particular quality requirements\nthen it's time to stop\nand say, okay, we need to do some quality assurance.\nNow remember this,\nquality assurance is when we go in there\nand we look for ways to help improve what we're doing.\nSo remember that for your exam,\ndoing quality assurance\nis gonna be a big thing on your exam,\ncontrol quality versus manage quality.\nRemember, manage quality is the quality assurance section.\nIt's where you're gonna look to how to improve\nour processes, what can we do to improve our products.\nThen the next thing you wanna do is continuously survey\nproject quality deliverable, survey project quality,\nproject deliverable quality.\nHow are you gonna do this?\nIf you remember in the process of control quality,\nwe got the stakeholders to come in\nand they were able to do an inspection\nand we were inspecting the deliverable\nto see if those deliverable met the quality requirements.\nSo in this one, this one here is, in this one here,\noops, it's actually off by there,\nI forgot I took up that screen,\nthis one is manage quality,\nand this one here is control quality, Q-U-A-L-I-T-Y.\nNow you know why I don't write much?\nYou have a slide here.\nYou guys never want me to write.\nI can barely spell and my handwriting is horrible,\nby the way, but I still write books, go figure out that.\nOkay, so you wanna make sure\nthat you understand determining the quality standards.\nThis is gonna be when we plan quality,\nlooking for options to,\nrecommended options,\nthis is gonna be where we do quality assurance.\nWhen we're taking a look at continuously survey\nfor project quality, doing the control quality,\nmake sure to review these processes.\nMake sure you know them well\nbecause you will be tested on the exam.\nNow, always remember,\nmanaging quality will be the responsibility\nof the project manager.\nIf your project's producing poor quality deliverables,\nthat's probably gonna be your fault.\nWork with the team,\nremember, inclusive tools once again,\nwork with the team, work with the stakeholders\nso we know what those quality standards are\nand then when the project's executed,\nmake sure that they're met or improve,\nimprove your process to make sure that they're met.\nGo to control quality.\nGet them inspected.\nEnsure those stakeholders know, those customers know,\nthat this project is meeting its quality requirements.",
          "keyConcepts": [
            "quality",
            "products",
            "deliverables"
          ],
          "transcriptLines": {
            "start": 18454,
            "end": 18577
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t8",
          "taskNumber": "Task 8",
          "title": "Plan and manage scope",
          "fullTitle": "Domain 2 Task 8: Plan and manage scope",
          "content": "--- Domain 2 Task 8 ---\n\n-: In this video, I'm gonna be covering Domain 2, Task 8,\nPlan and Manage Scope.\nNow, if you remember from the scope management project,\nscope management section\nwith all those processes,\nthat's gonna cover these tasks, these enablers in here.\nSo this task is saying,\nhey, you wanna make sure you know that.\nSo let's do a quick review of the processes,\njust in case you forgot.\nSo the first process was collect requirements\nwhere we went out and collected all those requirements\nfrom our stakeholders.\nThe output there was the requirements documentation,\nthe traceability matrix.\nThen we went and we defined the scope,\nand the output there was the scope statement,\nproject scope statement.\nNow remember, the scope statement contains\nwhat the project would do, what it wouldn't do,\nany type of constraints, any type of assumptions\nwas gonna be in there.\nThen the next thing we do is create the WBS.\nThis is was the output of the WBS,\nthe work breakdown structure.\nNow, the output, there was a scope baseline actually,\nwhich included the work breakdown structure,\nthe dictionary, the project scope statement.\nThen after that, we validated the scope,\nwe controlled the scope and validated the scope.\nSo control scope was the day-to-day activities.\nAs you're going through the project,\nthe day-to-day activities\nneeded to keep the project on scope.\nNow, validate scope comes at the end\nwhen the deliverable is done,\nand you're trying to get that stakeholder's acceptance.\nThat's gonna be your accepted deliverables.\nNow, those processes\nare really the traditional PMBOK process.\nIn an Agile project,\nthe Agile project, you know,\nwhat's the equivalent to a project scope statement\nto an Agile project?\nOn the Agile project, you have a scope statement.\nYou have the product backlog.\nSo the product backlog is gonna work as the scope statement,\nand as the product backlog is decomposed from epics,\nif you remember this, epics, you have features,\nyou have stories, you have tasks, and so on.\nSo as you are breaking down the work\nand you're assigning story points,\nthat's the equivalent\nof decomposition of WBS into activities\nas the deliverables into work packages.\nSo different projects, you're doing different things here,\nbut basically you're managing your scope.\nWhen the Agile project is executed, the team determines,\nokay, the team determines\nhow much of the product backlog we can get done.\nBut you also have to remember that the product owner\nis prioritizing that product backlog.\nOn the traditional WBS project,\nwhat's gonna happen here\nis the team members will estimate and decompose,\nhelp you decompose the work.\nDon't forget, expert judgment was a tool here.\nSo you're gonna get the experts to help you break it down,\nand then you guys determine when you want to do the work.\nSo these were the processes and scope.\nLet's take a look at the actual task here itself.\nSo the first thing up\nis to determine and prioritize the requirements.\nWhat are those requirements for the project?\nBut we're gonna do this\nin the process of collect requirements.\nNow, in the Agile world,\nyou don't have the ability just to do collect requirements.\nThe requirements are given to you by the product owner,\nby the customers, and the product backlog.\nWe gotta break down the scope.\nNow remember what I said.\nBreaking down the scope is gonna be where we're gonna go in\nand decompose those deliverables into work packages\nand decompose those into activities.\nThe product backlog, those things are, those are features,\nthey're epics, they decompose the features.\nYou have user stories, you have tasks.\nSo we do break the work down,\nand that helps us with the estimation of both time and cost.\nDon't forget, the more we break down the work,\nthe more precise our estimates will be.\nThen you wanna monitor and validate the scope.\nYou wanna make sure the project stays on scope,\nespecially on those traditional projects using the WBS.\nSo you wanna make sure that you monitor the scope.\nYou wanna make sure that the scope gets done\naccording to how it was supposed to get done.\nSo if you're supposed to paint it,\nbuild two rooms and paint the wall white\nand put this type of carpet in,\nwhen the project executes, you wanna make sure\nthose two rooms are the only rooms getting built,\nonly those carpets are getting done,\nand only this color paint will actually be put in there.\nWhen the work is done, you're gonna validate it.\nWe said this.\nSo this comes from the process of control scope,\nS-C-O-P-E,\nand then validate scope\ncomes just from the process of validate scope.\nSo you can see this link in here,\ndirect link between how this particular task\nand the task and the knowledge area\nof that scope goes together.\nBut don't forget Agile projects also, right?\nIn Agile projects, how are we gonna monitor the scope?\nHow are we gonna ensure the work is getting done\naccording to the customer requirements?\nYou see, validate scope,\nthe equivalent on an Agile project\nmore than likely falls into\nwhen the",
          "keyConcepts": [
            "agile",
            "scope"
          ],
          "transcriptLines": {
            "start": 18577,
            "end": 18714
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d2t9",
          "taskNumber": "Task 9",
          "title": "Integrate project planning activities",
          "fullTitle": "Domain 2 Task 9: Integrate project planning activities",
          "content": "--- Domain 2 Task 9 ---\n\n-: In this video, I'm gonna be taking a look\nat Domain 2: Task 9, Integrate Project Planning Activities.\nSo first of all,\nwhat exactly is project planning activities?\nThe project planning activities were those\n24 planning processes that we completed\nwhen we looked at all those project management processes.\nNow we do wanna understand that there are gonna be questions\non planning activities that has to get done\nfor Agile projects.\nNow remember, when it comes to Agile projects,\nthey don't have the 40,\nthey don't have 24 planning processes that we have in PMBOK.\nIn Agile projects, the planning is done generally\nduring the sprint planning or iteration planning meeting.\nThis is when the team determines how much work\nthey can get done from the product backlog.\nIn a traditional project,\nwe have to go through these 24 planning activities,\nand there is a lot of these 24.\nRemember, if you go straight down that giant chart\nof all those 49 processes.\nDevelop project management plan,\nthen you have collect requirements, define the scope,\nand so on and so on.\nCreate WBS and all the scheduling, just goes straight down.\nAll of those things.\nBasically, all of those 24 planning processes\nneeds to be integrated.\nAnd this comes from the process of integration,\nthis knowledge area of integration.\nWe have to integrate all those processes\nand consolidate all these plans\nto create that entire project management plan.\nSo there's gonna be a lot of dependencies.\nThere's gonna be a lot of, okay, let's do this,\nthen go back and do this.\nSo for example, you could be working on your scope statement\nand then you went and did some schedule and cost\nand come back and update your scope statement.\nYou did budgeting, you were doing your budget,\nyou went and edit some schedule changes or some cost changes\nor you did some quality changes or whatever.\nSome resource changes.\nSo remember, those 24 processes are iterations.\nThose 24 processes are gonna be done\nbasically all at the same time.\nYou're basically gonna be doing them over and over\nuntil you get it right.\nSo this is the process of integration.\nSo Task 9 here, integrate project planning activity.\nSo what we wanna do is we wanna consolidate\nall the different project plans,\nall the different project plans and phases.\nSo we wanna look at consolidation and combining them\nand integrating them in a way that we can flow\nthroughout the project.\nAssess consolidated project plans for dependencies, gaps,\nand continued business value.\nDon't forget, the project management plan\nhas many, many components.\nThey're gonna be dependent upon each other.\nFor example, you can't actually finish doing cost\nif you haven't done the scope.\nYou can't do schedule if you haven't really done scope.\nSo there's a lot of dependencies.\nYou can't do cost if you haven't done quality.\nBut then again, you can't do quality\nif you haven't known the work.\nSo a lot of it dependent on the scope\nand then the cost may come at the end.\nSo there's a lot of different dependencies\non the individual plans on the project itself.\nWe wanna analyze the data that's being collected\nto make sure that the data we're collecting\nand we're putting into the plan is adequate.\nWe don't wanna put high level estimates\nand then execute the project.\nAnd you're just way, way off because you never even thought\nabout how good the estimate was.\nCollect and analyze data, I put a line through that one.\nCollect and analyze data to make informed project decision.\nThe more accurate your estimate is,\nthe more better your informed decisions are.\nIf you get, from bad data comes bad in decisions.\nFrom good data generally means good decision.\nI'm saying generally, not all the time.\nDetermine critical information requirements\nneeded for your project.\nWhat are the critical information\nthat you're gonna need to be on your project?\nWhat are stakeholders gonna be looking for?\nWhat are particular reports gonna have?\nThat's what you're gonna have to determine\nin order to do this.\nSo first of all, the whole knowledge area\nof doing integration was a hot topic.\nI told you guys that integration is the actual requirements\nneeded by the project manager.\nWhat is the project manager job?\nTo be an integrator,\nto integrate all of those other nine knowledge areas.\nAs a servant leader on an Agile project,\nyou're working with the team member,\nyou're integrating all the components from the customers\nto the Agile project team to the product owner.\nAll of this has to be integrated working together\nto make sure the project is accomplished right.\nSo when doing your planning activities,\nmake sure everything is integrated,\nmake sure they function well,\nmake sure you get the right data\nto make the right decisions when it comes to your project.",
          "keyConcepts": [
            "agile",
            "scope",
            "quality",
            "business value",
            "integrate",
            "planning",
            "activities"
          ],
          "transcriptLines": {
            "start": 18714,
            "end": 18830
          },
          "agileRelevance": "high",
          "predictiveRelevance": "low"
        },
        {
          "id": "d2t10",
          "taskNumber": "Task 10",
          "title": "Manage project changes",
          "fullTitle": "Domain 2 Task 10: Manage project changes",
          "content": "--- Domain 2 Task 10 ---\n\n-: In this video, I'm gonna be talking\nabout manage project changes.\nThis is domain two, task 10.\nNow remember something,\nchange management is gonna be a hot topic on your test.\nI anticipate 10 plus questions\non your exam that's gonna come from change management.\nSo we're gonna spend a couple minutes on this.\nAnd then you gotta understand\nthat there's really two types of, two ways\nof managing changes.\nOn a project,\nyou're gonna have a change management procedure\nfor those strenuous traditional project model.\nThen you're gonna have a change management procedure\nfor your agile projects.\nYour traditional projects is gonna be changed.\nYou're gonna be able to do changes,\nbut it's gonna have\nto go through submitting a change request.\nGetting the change requests assessed.\nGetting it assessed to understand the impact\non the other project objectives.\nTaking it to the change control board.\nEnsuring they approve or disapprove it.\nWhen you get their approval,\nthen you're gonna update all the other project documents\nlike the scope, the time, the cost, and so on.\nSo that's gonna be managing a change\non a traditional project.\nNow, on a agile project, it's gonna be different.\nOn an agile project, what you're gonna be doing is\nyou're gonna be anticipating change.\nPeople are just gonna give you stuff.\nThey're always just gonna add things,\nespecially when it comes to features.\nBut when they add something,\nit goes into the product backlog.\nThe product backlog is then reprioritized.\nRemember for your exam, this is reprioritized\nby the product owner based on how valuable the features are.\nSo if somebody adds in a change that is highly valuable,\nit may just go to the top of the product backlog.\nIf somebody adds in a change that's not so valuable,\nit may go to the bottom or somewhere in the middle.\nSo remember something on the traditional project,\nyou're gonna follow that change management process.\nSubmit a change request, assess it, look at its impact,\ngetting it approved by the change control board,\nand then implemented it.\nOn the Agile project, when people wanna change,\nthey add it to the product backlog.\nAnd then the product backlog is reprioritized based\non these changes.\nSo these are the processes.\nYou have to make sure you know these well for your exam.\nSo let's take a look at what they want us to know.\nSo the first thing up is you wanna anticipate\nand embrace the need for change,\nlike following a good change management practice.\nAnd remember, the practice is gonna be dependent.\nIs it an agile project\nor is it gonna be a traditional project?\nNow remember that, you.\nRemember in Agile, we talked about changes.\nYou wanna embrace changes.\nAnd then when I was teaching you PMBOK, I was like,\nyou want to have a nice strenuous change management process.\nIn both agile and traditional projects,\nyou want to make sure that you embrace the need for change.\nYou know, I said this earlier.\nIf your stakeholders are not asking for change.\nIf your stakeholders are not coming\nto you on a every other day\nor maybe a daily basis, oh, can you change this?\nCan you add this?\nCan you modify this?\nIf they're not doing that, I would worry.\nYou know why?\nBecause that means they don't care.\nThat means they're not engaged.\nWhen they're engaged, they're gonna ask for change.\nThey're gonna let you know what they don't like\nand what they like.\nI love it when stakeholders are asking me for change.\nIt shows they care.\nIt shows they they want that deliverable\nthat that project will produce.\nSo you wanna anticipate it and you want to embrace it.\nDo not suppress change.\nDo not become a medium of where change is a problem for you.\nEven on a traditional project\nthat follows a strenuous change management procedure,\nyou still wanna anticipate the change.\nYou still want to embrace it,\nbecause it still shows like they care.\nHow are we gonna handle the changes?\nThis is what I was just discussing with you.\nOn that traditional project,\nyou're gonna have your change request.\nYou're gonna go through a change control board\non that agile project.\nPut it in product backlog, make sure you prioritize it.\nWhatever strategy it is you're using based on traditional\nor agile, you want to execute that strategy according\nto the methodology of maybe traditional or agile.\nAnd then, determine a change response\nto move the project forward.\nIf the change is assessed, it's approved,\nyou get it implemented, then you're gonna get that change,\nget it approved, and get it implemented in a process.\nAnd then your 49 process, all those execution processes,\nare gonna have to to get that change done.\nSo the other one is in agile.\nIf the proj, if the change gets added in, goes\nto the top of the product backlog,\nthen hopefully in the next few iterations\nor the next iteration, that change gets done.\nLet's talk about your exam for a minute.\nOn your exam, I'm gonna give you some tips\non change management.\nI told you this is a pretty large topic on your exam.\nNumber one, never sup",
          "keyConcepts": [
            "agile",
            "change management",
            "scope",
            "changes"
          ],
          "transcriptLines": {
            "start": 16996,
            "end": 17164
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d2t11",
          "taskNumber": "Task 11",
          "title": "Plan and manage procurement",
          "fullTitle": "Domain 2 Task 11: Plan and manage procurement",
          "content": "--- Domain 2 Task 11 ---\n\n-: In this video,\nI'm gonna be going over domain 2, task 11,\nplan and manage procurement.\nNow, this particular task\nand its enablers mapped directly back\nto plan procurement management, in that knowledge area.\nCan you remember the processes there?\nIt was what?\nIt was plan procurement management.\nIt was conduct procurement and controlled procurement.\nSo the first thing we did was plan procurement.\nIn which case we had the procurement management plan,\nwe got the procurement documents,\ndocumentation and so on which outlined what is it we wanted.\nThen we determined to conduct procurement\nwhere we selected a seller,\nawarded our contract and then we controlled procurement\nby ensuring to manage the contractor\nto make sure that the work getting done\nwas outlined in the contract.\nSo, this task maps directly to that.\nSo, in this particular task,\nwhat we're gonna be doing,\nis the first thing we gotta do\nis define the resource requirements and the need.\nWe have to say to ourselves do we need any resources\nfrom outside?\nThis is what you're doing\nin the plan procurement management process.\nWhat is the resources needed to build a deliverable?\nDo we have those resources internally\nor do we have to go externally?\nThen you have to determine how much of it you need,\nwhen do you need it?\nSo, let's say you determine,\n\"Well, we don't make paint,\n\"so we're gonna have to procure that.\n\"We're gonna have to go buy paint from the outside world.\"\nRemember, procurement dealt with anything\nthat you're getting from outside the project team.\nSo, if you're gonna go outside and buy paint,\nthen you gotta determine how much paint you need\nand what type of paint you need.\nNow some organizations are very much willing\nto procure things out, some are not.\nSome prefer to do it in-house.\nYou gotta know the organization methodology on that.\nAre they more willing to go outside\nor more willing to be inside on the project?\nSo, define what those resource requirements are\nand then because you're get outside resources now\nand the needs of them.\nThen communicate those resource requirements\nto the potential sellers.\nSo, you want to let them know,\n\"Okay, this is what we're looking for.\"\n\"We're looking for a programmer with the skillset,\n\"we're looking for a painter with this skillset\n\"we're looking for a system administrator with skillset.\n\"We're looking for four gallons of paint\n\"and two paintbrushes.\"\nThen you have managed suppliers and contracts.\nSo, we went over in this section,\nall the different contracts you're gonna need to know,\nremember there was fixed price,\ncost reimbursable, time material.\nYou're gonna have to know what contract is best\nfor what type of project.\nIt's gonna be dependent upon the scenario there.\nAnd I do anticipate a question on this on your exam\nwith those different types of contract,\nmake sure to review them.\nMake sure you know what they are\nPlan and manage a procurement strategy.\nSo, how are we gonna select the the potential seller?\nWhat can we do to keep the seller working correctly?\nThis is gonna come with that procurement strategy.\nHow are you gonna select it?\nWhat type of contract you want,\nwhen they start working,\nhow are we gonna make sure\nwe actually keep them working correctly?\nHow are we gonna check their work?\nAnd then once they come into play,\nwe gotta come up with a solution\nof how they're gonna be delivering the product to us.\nThat's satisfiable to the project.\nSo procurement.\nNow, very rarely have I ever heard of a project\nthat didn't go outside.\nVery rarely.\nA lot of software development and agile projects,\na lot of agile projects first of all are done in inside\nas they have their own internal programmers,\ndoing the work for them.\nBut you do have agile contract in\nand we talked about that in the agile section\nin which case if you variety different contracts,\neven though it's difficult,\nlike using a fixed price per work package.\nIf you don't know what I'm talking about,\nplease review the agile section on this.\nSo, on most traditional projects,\nprocurement is gonna be something you're gonna be doing.\nOn agile projects,\nmaybe half the time,\nyou're gonna be doing some kind of procurement.\nMost agile projects again is done internally.\nOkay, so remember when you're doing procurement,\nyou wanna define those resource requirements\nand what you're gonna need.\nYou wanna make sure you communicate\nthese resource requirements to the sellers,\nget a contract and manage those sellers.\nYou wanna come up with a strategy of how to select them\nand how to manage them.\nAnd then of course,\ncome up with some kind of delivery solution\nto implement this new resource.",
          "keyConcepts": [
            "agile",
            "procurement"
          ],
          "transcriptLines": {
            "start": 17164,
            "end": 17286
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t12",
          "taskNumber": "Task 12",
          "title": "Manage project artifacts",
          "fullTitle": "Domain 2 Task 12: Manage project artifacts",
          "content": "--- Domain 2 Task 12 ---\n\n-: In this video, I'm going to be talking\nabout Domain 2: Task 12, manage project artifacts.\nSo, what exactly is an artifact?\nAn artifact is generally a project document.\nMost of the time, almost all of the artifacts\non a project is gonna be some kind of digital\nor tangible document that's gonna be on the project.\nSo, you want to make sure you know\nwhy you need that document.\nYou want to make sure how it's used, who made it,\nwhere they made it, how they made it, and so on.\nAnd you want to make sure that those documents are stayed\nup-to-date and you want to make sure they're effective.\nSo, let's take a look at what exactly\ndoes PMI wants us to know about this?\nSo, manage project artifacts.\nSo, first of all,\nyou want to determine the requirements for these artifacts.\nWhat is the artifact?\nMaybe it was a risk register.\nWhen did we make it?\nOr when are we gonna make it?\nThis is generally done during the risk management plans.\nWhere are you gonna do it?\nWho's gonna do it?\nAnd so on.\nSo, these are things that you get access to,\nespecially now remember, if you remember\nfrom those 49 processes, there's a ton of documents.\nThe next thing you want to do is to validate\nthat the project information is kept up-to-date,\nlike version controls and is accessible to all stakeholders.\nRemember, project artifacts can also\ninclude the project management plan, the project charter,\nthe business case, and so on.\nWe want to ensure that the information\nwithin these documents is kept up-to-date\nand you want to make sure\nthat it's accessible to all stakeholders.\nFor example, the work performance information\nor the work performance report especially,\nshould be accessible to certain stakeholders.\nYou want to make sure that the information is up-to-date.\nYou don't want to have an old project report there\nand every time your sponsor or checks it,\nit doesn't look like the project is moving anywhere\nbecause there's been no updates to it.\nSo, you want to make sure you keep it\nup-to-date and you want to make sure it's accessible.\nThen you want to continuously assess the effectiveness\nof the management of these project artifacts.\nAccess F, are we managing these documents correctly\nor are we lacking on this?\nAre we doing this\nin a job that is meeting the needs of the stakeholders?\nOr are we lacking on this?\nSo, we'll want to make sure we review that.\nSo, these are gonna be things here to keep in mind as you go\nthrough managing all the different project artifacts.\nYou want to make sure you determine requirements for them.\nYou want to make sure you keep 'em up-to-date,\nmake 'em accessible, and of course you want\nto check the effectiveness of them on the project.",
          "keyConcepts": [
            "risk",
            "project charter",
            "artifacts"
          ],
          "transcriptLines": {
            "start": 17286,
            "end": 17352
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t13",
          "taskNumber": "Task 13",
          "title": "Determine appropriate project methodology/methods and practices",
          "fullTitle": "Domain 2 Task 13: Determine appropriate project methodology/methods and practices",
          "content": "--- Domain 2 Task 13 ---\n\n-: In this video\nwe're gonna take a look at domain two, task 13,\ndetermine appropriate project methodology/methods\nand practices.\nSo, when starting a project in today's world,\nyou have basically three different methodology you can use.\nYou could go with a complete predictive traditional method,\nthroughout the entire project.\nYou could go with a agile approach.\nMaybe you could throughout the entire project\nor maybe you can combine them\nin which case you'll do a hybrid approach\nwhere you're gonna have parts of it being done\nin traditional and parts of it being done\nin a more hybrid approach.\nSo, you have to determine which way is best\nand then you have to determine\nat what parts of the lifecycle\ncan you use one over the other.\nSo for example, collecting requirements on a project,\nmay be done used in traditional methods\nbut developing the actual product itself\ncan be done using Agile.\nBut rolling out the product\ncan follow a traditional predictive\n'cause you've done it before.\nGenerally speaking parts of the project,\nbut uncertainty would use a more agile approach\nas we're not too sure where we're building.\nSo, we want a lot of feedback.\nBut on parts of the project\nwhere there's not a lot of uncertainty,\nsuch as rolling out a new product or testing something,\nthis phases of the project,\nwe don't necessarily need to have agile,\nbecause it's not not a lot of uncertainty,\nbecause you've done it so many times before.\nSo, you have to determine what's best for your project\nand that's what this particular task is about.\nSo, let's take a look.\nSo, in order to determine that methodology or method,\nyou're gonna have to assess the needs of the project,\nthe complexity and the magnitude.\nBig projects, many different phases.\nHigh complexity, high uncertainty,\nhigh customer feedback requirements and so on,\ncan really drive whether it's a traditional\nor it's it's agile or hybrid.\nThis is something that you need to,\nthere's no right answer here.\nDon't think I'm gonna tell you that on a complex project\nyou need traditional,\nno there's no such thing.\nEvery project is different, every organization is different.\nI could give you guys a complex project right now\nand half of you are probably do them in traditional,\nhalf of you're probably doing in agile\nor maybe some of you'll even do hybrid.\nAnd again, you know what?\nIn the hybrid section I mentioned,\nmost projects are actually done\nin some form of hybrid approach.\nThey may use, they may utilize a lot of traditional,\nsome of the agile practice.\nOr they may do a lot of agile practices from a traditional,\nevery project is different.\nYou have to know what's right.\nRecommend an execution style, for example a contracting\nfor how we're gonna finance the project.\nHow are you gonna contract out with the project?\nRecommend the methodologies,\nwhat we're talking about, predictive, agile, hybrid.\nUse iterative, incremental practices,\nthroughout the lifecycle.\nYour exam really pushes\nand wants you to use incremental delivery.\nRemember, there's a lot of benefits\nwith incremental practices.\nEven if the incremental practice doesn't produce\nin a hybrid way, the incremental practice,\nmay never come out to be a release.\nIt may just be something like a prototype\nthat you give to your customers for more feedback.\nSo, this would be when a traditional project,\nmay start to use methods from an agile project.\nSo, we have to say to ourself,\n\"Okay, let's try an incremental procedure,\n\"so we can get more stakeholders engagement.\"\nWe can understand risk earlier,\nwe can get more lesson learned from it.\nOn your exam, I may have mentioned this before,\nbut on your exam,\nremember that when you want customer feedback,\nif you feel that in that question\nthat if the customers would've given more feedback,\nit would've solved the problem,\nthen the answer is to use an incremental method.\nBecause the incremental method\nor producing it in increments will lead\nto the actual more engagement of the customers.\nThey're able to give you their reviews\nand give you their feedback.\nOkay, so just remember in today's world,\nyou have a couple different methods to choose from.\nI'm not even gonna go into agile right now,\nbecause there's just so many agile methods out there.\nDon't forget, agile is an umbrella term.\nThere's so many agile methods that are out there.\nAnd now combining them with a hybrid,\nmaybe we have an infinite number\nof methods that are out there.\nSo, choose the one that's best for your project.",
          "keyConcepts": [
            "agile",
            "risk",
            "contract",
            "determine",
            "appropriate",
            "methodology",
            "methods",
            "practices"
          ],
          "transcriptLines": {
            "start": 17352,
            "end": 17467
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d2t14",
          "taskNumber": "Task 14",
          "title": "Establish project governance structure",
          "fullTitle": "Domain 2 Task 14: Establish project governance structure",
          "content": "--- Domain 2 Task 14 ---\n\n-: In this video,\nI'm gonna be talking about Domain 2, Task 14,\nEstablish Project Governance.\nNow, first of all, you have to understand\nthat we have something called corporate governance.\nSo corporate governance is basically\nwhat you're gonna do to manage the organization\nto produce value to its shareholders or to its owners.\nIn a project, it's basically the same definition.\nIt's what we're gonna do to the structure\nof how we're going to manage the project\nso we can produce value to our,\nnot shareholders, but to our stakeholders.\nThat's what this is about.\nWe have to come up with the right governance structure.\nMaybe we could mimic what the organizational governance is,\nincorporating organizational policies and procedures\ninto our project.\nRemember something, on our projects,\nwe're not gonna throw away your organization policy.\nProjects should incorporate\norganization policies within them.\nSo, for example,\nif the organization has a very particular policy\nhow changes should get done,\nthen the project may incorporate\nthose particular policies within it,\nand that's how we're gonna manage change in our project.\nIf the organization has an escalation path\nof how problems are handled\nor how resolutions are situated or comes up with,\nthen maybe we wanna include that in our projects also.\nLet's take a look at what it says here.\nSo, when it comes to defining a governance structure\nof how the project would be laid out,\nmaybe you have your sponsor, you have your project manager,\nyou have your team members, your structure.\nThis is the escalation path.\nThis is how people get to the sponsor.\nThey talk to the project manager that talks to the sponsor.\nThese are the thresholds of how communications may be done\nbefore it hits, before it goes up the ladder.\nRemember, governance is all about\nhaving that structure in place of how to manage a project.\nSo we want to determine\nthat appropriate governance for your project.\nMaybe look at how the organization is designed.\nThere are some organizations that are very, very vertical.\nIn other words,\nthey have some huge escalation path that goes upwards.\nYou can't get to the CEO until you talk to Bob.\nYou can't get to Bob until you talk to Mary.\nYou can't get to Mary until you talk to Peter.\nYou can't get to, and it keeps on going.\nThen there are organizations that are more horizontal,\nwhere the CEO door may be open.\nHere at TIA, my door is always open.\nI am the boss here at TIA, and my door is open to everyone.\nThere's no escalation path.\nThe escalation path is, because we're a smaller business,\nif you have an issue, you just come in and talk to me.\nYou don't have to talk to my assistant.\nI have a lovely assistant.\nShe helps me out.\nShe's my right hand.\nShe does all my work for me.\nShe reminds me a lot of things, but you know what?\nYou don't need to go to her to talk to me.\nThere's no escalation path there.\nSo we have to define are there escalation paths,\nand what is the threshold before you can go beyond someone?\nOkay, you know what?\nI've hit the threshold of this person.\nNow I gotta go up.\nSo different projects, different, bigger business\nmay have that high escalation path.\nSmaller ones may have a much lower escalation path.\nOkay, so for your exam,\nyou wanna be able to determine\nwhat governance is right for your project.\nYou wanna know what those escalation paths are\nand the thresholds,\nso when people know how to communicate,\nthey know who to communicate it to\nand you wanna make sure that the governance structure\nis appropriate for your project.",
          "keyConcepts": [
            "communication",
            "governance",
            "establish",
            "structure"
          ],
          "transcriptLines": {
            "start": 17467,
            "end": 17556
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t15",
          "taskNumber": "Task 15",
          "title": "Manage project issues",
          "fullTitle": "Domain 2 Task 15: Manage project issues",
          "content": "--- Domain 2 Task 15 ---\n\n-: In this video,\nI'm gonna be talking about Domain 2:Task 15,\nmanage project issues.\nNow, issues are something that's happening on a project\nthat's probably gonna have\nsome kind of negative impact.\nIssues can be things such as the supplier is late,\nor that's all,\nit's an ongoing thing where the supply is always late.\nIt could be a permit is being delayed.\nIt could be that a particular piece of the software\nis failing the testing.\nIt could be a team member is having conflicts with others.\nIssues are something\nthat's gonna always happen on a project.\nNow, I do wanna differentiate risk and versus an issue.\nWhat is the difference between risk and an issue?\nSo remember,\na risk is something that happens before an issue.\nWhen a risk,\nand when a risk happens and it's a negative risk,\nit becomes an issue.\nSo a negative risk will turn into an issue.\nIf it materializes, I shouldn't say when.\nI should say if a negative risk materializes itself,\nit would become an issue.\nSo remember, an issue is generally a risk\nbefore it becomes an issue.\nWe wanna be able to recognize when, if this, I should,\nI keep saying when with risk.\nIf this risk happens that it will be an issue\nthen we want to be able to resolve it completely.\nSo here we go.\nThe first thing we wanna do is recognize\nwhen a risk may become an issue.\nWhen would the risk become an issue\nthat would need to be solved?\nWe would then ask ourselves, we wanna,\nhow do we attack this issue\nwith the optimal action to achieve success?\nFor example, if the supplier's consistently late,\nhow do we attack this issue?\nMaybe do we call the supplier\nand complain to them and try to see,\ntry to include them in resolutions with our team members\nand see how can we come up with actions\nthat can lead to them being on time more?\nOr maybe we can't.\nMaybe the best solution is to just find a new supplier.\nWe have to determine what's the best action for the project.\nNow remember, for the hundredth time,\ncollaborate, inclusive not exclusive,\ncollaborate with relevant stakeholders\non the approach to resolve the issue.\nNotice it didn't say,\nit didn't say in the objective for you to resolve it.\nIt says for you to collaborate, right?\nWe wanna collaborate with people to fix things.\nAs a PMBOK project manager, we don't fix anything.\nYou know, as an Agile project manager,\nwe don't fix anything.\nWe don't come up with solutions.\nWe collaborate with people\nto have them come up with a solution.\nRemember that for your exam,\nand I keep saying this over and over,\nand you guys are thinking I'm crazy right now,\nbut when you take your exam\nand you do what I'm telling you,\nyou pass, you'll say,\n\"Okay, he knows what he was talking about.\"\nOkay, so before we end this off,\nyou must recognize when a risk may become an issue.\nYou wanna attack that issue\nwith the right results to ensure project success.\nAnd of course, when attacking it,\nand choosing and the right solution,\nmake sure that you collaborate with the right stakeholders\nto come up with the right solution.",
          "keyConcepts": [
            "collaborate",
            "agile",
            "risk",
            "issues"
          ],
          "transcriptLines": {
            "start": 17556,
            "end": 17638
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t16",
          "taskNumber": "Task 16",
          "title": "Ensure knowledge transfer for project continuity",
          "fullTitle": "Domain 2 Task 16: Ensure knowledge transfer for project continuity",
          "content": "--- Domain 2 Task 16 ---\n\n-: In this video, I'm gonna be taking a look\nat domain two task sixteen,\nensure knowledge transfer for project continuity.\nNow what this is, is knowledge transfer.\nKnowledge transfer occurs in between different stages\nof the project and within the project.\nKnowledge transfer occurs between team members learning\nabout information and transferring that to each other.\nThis can be done using automotive communications\nor using that lesson learned register\nthat we talked about when we went over those 49 processes.\nDirect to manage project work,\nyou guys remember this, but the execution part\nthen comes managed project knowledge there in execution.\nGet the lesson learned to register.\nNow when a project on a, well, I should say on a project,\nthere's gonna be different teams and there has to\nbe a knowledge transfer between the different teams.\nTake for example, when the designers are finished\nthey're gonna transfer their knowledge of how\nthey want the software to be designed to the programmers.\nThe programmers gonna program it and whatever they found\nor bugs that they may have discovered or couldn't fix\nand they gave it to the testing team,\nthey're gonna be transferring those knowledge how\nto program and the best way to use it to the testing team\nthe best way to test it.\nWhat the testing team found,\nthey're gonna then transfer that knowledge\nto the implementation team.\nSo it has to be a knowledge transfer amounts.\nAnd then when the project is done itself\nthat final close project\nor phase where you're gonna do that big lesson learned\nat the end, that gets absorbed\ninto the organization, into that, into your PMO.\nAnd then that knowledge transfer is given out\nto other projects within the organization.\nSo let's take a look at what, what it wants us to know.\nSo what we are gonna talk about is\nthe project responsibilities within the team.\nThe team should know\nthat knowledge transfer is needed, helping each other,\nand this is knowledge transfer within the team itself.\nTeam members should help each other.\nTeam members, remember in the agile world,\nwe have generalizing specialists.\nSo a generalizing specialist would want knowledge transfers\nto happen and for everyone to help each other\non this particular project.\nWe wanna outline the expectations\nfor the working environment.\nAs we're working, as we're learning things\nwe're putting it into the lesson learned registers\nso it could be utilized later on.\nConfirm, confirm approach for knowledge transfer.\nWhat exactly is your approach for this?\nPutting in the lesson learned register,\ngiving it over to the PMO.\nThe PMO gives it out to other projects.\nThroughout a project in any organization,\nthere's gonna be a lot of knowledge gain,\nmaybe knowledge of how to build a particular product\nor how to solve issues with a particular product.\nWhen the project is done, this is,\nthis knowledge should be transferred\nto different teams within the organization.\nThis is gonna help the organization best support\nthat product to ensure\nthat the customer gets the best value from this product.",
          "keyConcepts": [
            "communication",
            "agile",
            "knowledge transfer",
            "transfer",
            "continuity"
          ],
          "transcriptLines": {
            "start": 17638,
            "end": 17711
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d2t17",
          "taskNumber": "Task 17",
          "title": "Plan and manage project/phase closure or transitions",
          "fullTitle": "Domain 2 Task 17: Plan and manage project/phase closure or transitions",
          "content": "--- Domain 2 Task 17 ---\n\n-: In this video,\nI'm gonna be taking a look at Domain two: Task 17,\nPlan and Manage Project Phase Closure or Transition.\nSo this is basically the last task\nin domain two, by the way.\nSo it should end with closure.\nEvery project in its definition is gonna come to an end.\nIt has to come to an end.\nIt's not operations.\nOperations is the opposite to a project.\nIt doesn't have an end date.\nBut projects has an end date,\nso we know we're gonna have to close it out.\nWhat are we doing when the project closes out?\nWell, we're gonna wanna make sure\nthat this is series of tasks,\nwhether it's doing that final lesson learned.\nIf it's an Agile project,\nyou're gonna be doing your retrospective\nthat comes at the end.\nYou're gonna wanna make sure you pay off all the bills.\nYou're gonna wanna make sure\nyou release the resources that are there.\nYou're gonna wanna make sure\nyou archive the project records, and so on.\nSo there's quite a lot of things.\nWhen a project is done,\nit's not just, \"Okay, everybody go home,\n\"let's all go and go to the bar,\n\"grab a couple of drinks and celebrate and we're done.\"\nNo, there's still a lot of work that has to get done\nto formally and administratively close the project.\nA formal closure procedure on both Agile\nand traditional project is mandatory.\nSo let's see what it wants us to know.\nSo one of the things we're gonna have to do is\ndetermine the criteria for successful close\nto successfully close the project or phase.\nWhen a phase is done or the project,\nso remember when the final phase is done\nyou close a project,\nbut throughout the project\nyou're closing each individual phase.\nSo the coding phase is done, the testing phase is done.\nWhat is the criteria to determine that that phase is done?\nFor example, in the testing phase\ndid the software has to meet a certain testing result\nfor it to be considered, finished or successfully tested?\nWhen the coding phase was going on\ndid it had to meet a certain functionality\nfor it to be says, \"Okay, we're done coding, right?\"\nWhat's that?\nWhat's that criteria?\nIf you're building a house,\nwould it be the foundation?\nThat's one phase building the foundation.\nWould it be passing a inspector,\ngetting a regulator or some kind of inspector\nto come and pass it?\nIs that when it's done?\nI don't know.\nIt depends on the project, right?\nYou have to document that.\nYou have to say,\n\"Well this is the criteria\n\"that's gonna mark the end of this phase.\"\nWhen this criteria is met, this phase is done.\nWhen this criteria is met, this project is done.\nThen you gotta validate the readiness for the transition.\nAre we ready to transition from one phase to the next?\nAre we ready to give this over to operations?\nMaybe the testing team found errors\nthat cannot be fixed\nand they're not ready to give it over\nto the implementation team.\nMaybe now it has to go back to coding to be fixed.\nSo we're gonna have to determine this.\nAre we ready to move forward?\nAre we ready?\nYou know, the, the, the testing team could be done.\nWe're ready to just to push it\ninto operations and maintain it.\nBut then we found so many bugs in testing\nthat we are saying software is not usable.\nLet's pull it back.\nLet's fix it.\nLet's recode parts of it before we push it out.\nIt's not ready.\nAnd then finally\nwe're gonna have to close this project down.\nWe're gonna have to conclude the actual closeout\nof the project or the phase.\nWe're gonna do those final lesson learned.\nThis of course, is gonna get stored\nand goes into the project management office\nwhich is gonna then be given out\nto the other projects.\nDo the retrospective.\nWe're gonna learn what we did right, what we did wrong,\nwhat we're gonna do more of, what we're gonna do less of.\nWe have to close out our procurement contracts.\nWe have to make sure\nthat whatever was in that contracts we're actually done.\nWe have to make sure that we pay them.\nIf there's any type of benchmarks\nthat has to be met by those vendors,\nwe wanna make sure it's done.\nFinancial, we must close all financial accounts.\nPaying the project bills,\ncredit cards is gonna have to get done.\nAnd you wanna make sure you release your resources.\nCertain resources may be released\nto go back to operational duties.\nSome resource, some team members may be released completely\nand have to go find all the projects\nsuch as consultants would be like that.\nSo quite a lot to do\nwhen you think about closing out your project.\nIt's not something that you're gonna do\nany easy one-time thing.\nYou just can't walk away from a project\nwhen the work is done.\nIt has to be administratively closed\nor I should say it should be formally closed.\nThat way the organization know what to do\nwith the project records like archiving them.\nThat way other projects can then use the information\nwe learned from this project\nto make those projects better.",
          "keyConcepts": [
            "agile",
            "procurement",
            "closure",
            "transitions"
          ],
          "transcriptLines": {
            "start": 17711,
            "end": 17843
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        }
      ]
    },
    {
      "id": "domain3",
      "name": "Business Environment",
      "examWeight": 26,
      "description": "The connection between projects and organization strategy",
      "taskCount": 4,
      "tasks": [
        {
          "id": "d3t1",
          "taskNumber": "Task 1",
          "title": "Plan and manage project compliance",
          "fullTitle": "Domain 3 Task 1: Plan and manage project compliance",
          "content": "--- Domain 3 Task 1 ---\n\n-: In this video, I'm gonna be talking\nabout Domain Three, Task One.\nThis is gonna be in the business environment domain,\nplan and manage project compliance.\nNow before I get into Task One,\nlet me just talk a little bit about this domain.\nRemember this domain is worth 8% of your exam questions\nand a lot of it is gonna come from actually Task One\nwhich is gonna be compliance.\nIf you think about this,\nif there's four tasks in here and it's 8%,\neach of them would be worth 2%,\nat a minimum, you'd probably get four questions right.\n2%, four questions, 2% of 200 questions in theory.\nSo do expect questions on this\nand they are probably gonna be pretty easy.\nBut before I get into this task,\nlet's talk about this.\nThis particular domain is about\nthe project manager understanding\nthat they have to know the business environment\nthat they're working in to conduct the project.\nBuilding a financial application in a school\nis a lot different than building a financial application\nin an insurance company\nor in a stockbroker company.\nIt's a lot different than doing it\nin a manufacturing company.\nWe all follow different regulations,\neven though it seems like it's the same thing.\nThere are so many compliance,\nso many regulatory laws,\nso many different procedures, so many different departments.\nFor example, we have a department called student Services.\nNobody has that but us, right?\nBut our schools, so you would need to understand\nwhat are those different business environment\nand how your projects can work within them.\nOne of the first things you're gonna do\nwhen you go and you get a job within an organization\nis to find out about this business,\nis to find out how they do business,\nis to find out how that industry works,\nis to find out what regulations they work.\nYou see this quite a lot when you apply for a job.\nSo if you're applying,\nif you work in finance or you work in insurance,\nyou work in banking, you work in education,\nyou're pretty much stuck\nbecause you can apply for jobs in other industries\nand it's very hard to change your industry\nbecause everybody wants someone to know their industry,\nto know that business environment that they're working in.\nYou can't manage a project\nif you don't know the regulations,\nyou don't know how that business works\nand how that industry works.\nThat brings me into Task One, right?\nSo plan and manage compliance\nand let's take a look.\nBefore I get into this,\njust keep in mind compliance is generally mandatory.\nYou must implement this.\nThings like safety and health, regulatory compliances\nhas to be implemented.\nThere's no ands, ifs, and buts.\nIf you're managing, if you're working on a job site,\nif you're building a building and it's a job site\nand there has to be certain safety equipment\nbe worn by the team members,\nthey have to wear it.\nIf building a building requires you to use\ncertain types of materials to pass certain regulations,\nyou have to use it.\nThere's no ands, ifs, and buts.\nSo when it comes to regulations,\nyour objective on your exam\nis to ensure, no matter what, it gets done.\nIf it's required by law,\nyou do it no matter what.\nI've seen the practice questions\nwhere there were questions where it was the potential,\nthe sponsor doesn't like it,\nthey don't want you to implement it,\nand the answer is teach them why they should\nor educate them why it will get done,\nbecause they have to get it done.\nLet's take a look.\nSo first of all, you're managing a project.\nYou wanna confirm project compliance requirements.\nIs there some kind of compliance\nthat needs to get done?\nAnd again, security, health and safety,\nregulatory requirements.\nBuilding a financial system,\nyou may follow certain types of laws\nthat publicly traded companies may follow\nversus a nonpublicly traded company\nmay not have to follow those.\nKnow what they are.\nClassify your compliance categories.\nMaybe you have financial categories,\nmanagement categories, safety categories.\nWhat are the threats to compliance?\nWould it be the willingness of the team members\nto implement those requirements, those compliance?\nSomething like wearing a hard hat\nat a construction site is a compliance issue.\nIf they don't want to do that,\nthat's a compliance problem.\nYou couldn't even get fined.\nThe project can get fined.\nWhat are methods to supporting these compliance?\nMaybe we wanna identify them early.\nYou wanna build them into\nthe project management plan, the project charter.\nYou wanna go out and educate people about them.\nYou got to get support behind it.\nRemember these things are not mandatory.\nAnalyze the consequences of noncompliance.\nFined, at the best case is a fine.\nAt the worst case,\nat the second worst case\nwould be termination of the project.\nAt the worst case, go to jail.\nThose are the three levels.\nEither you're gonna get fined\nor you know what?\nThere's a level worse than a fine, a warning.\nBut here especially in New York\nand especially in the education industry,\nthe education department with us, there's no w",
          "keyConcepts": [
            "compliance",
            "project charter"
          ],
          "transcriptLines": {
            "start": 18830,
            "end": 18999
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d3t2",
          "taskNumber": "Task 2",
          "title": "Evaluate and deliver project benefits and value",
          "fullTitle": "Domain 3 Task 2: Evaluate and deliver project benefits and value",
          "content": "--- Domain 3 Task 2 ---\n\n-: In this video, I'm gonna be going over Domain 3: Task 2,\nEvaluate and Deliver Project Benefits and Value.\nLet's get into it.\nWhy do companies do projects?\nBecause there's some value to gain.\nWhy do we do anything in life, first of all?\nBecause we want something.\nWe want something of value.\nWhy do we eat?\nSo the value is, so the food tastes good\nand the value is we can stay alive.\nWhy does a organization implement\nthat new accounting system?\nBecause the value is, they can decrease their expenses\nand make their processes more efficient.\nWhy does Samsung build this beautiful phone that I'm using?\nBecause it makes them money,\n'cause I'm gonna buy it.\nWhy does organizations basically do things\nto get some kind of value?\nWhy do we do anything to do to get value?\nProjects is about value.\nProjects is about delivering value to our stakeholders.\nIt's about delivering value to the organization\nin other words.\nThose values can be defined as increased revenue,\ndecreases expense, more customer loyalty,\nmore customer happiness,\nemployee loyalty, employee happiness.\nSomewhere along the line\nthey're seeing some kind of value to this.\nSo what are we gonna have to do?\nLet's take a look of what PMI wants us to know.\nSo we wanna be able to know when a project is getting done\nand then the business environment of itself.\nWe wanna take a look\nand investigate that benefits are identified.\nWhat are those benefits?\nWhy are we doing the project?\nI'm pretty sure\nyou guys are probably gonna ask yourself this.\nI've probably seen this in previous companies.\nThere were projects that were getting done.\nIt's questionable whether,\nwhat benefit are they getting from doing that?\nMaybe you didn't know.\nMaybe the organization didn't know.\nMaybe the project started a long time ago\nand there's no benefits left to gain from it\nbecause things changed.\nSometimes project takes a very long time to get finished\nand the organization changes\nand the benefits that project is delivered\nis not needed anymore.\nTake for example, you may be developing a new way\nto contact your customers,\nand to make it more efficient to contact customers\nthrough a lead generation system.\nBut then the organization changed a while back\na couple of months ago\nto use a brand new CRM and it does it all.\nSo you developing this on the website,\nit's pretty useless now.\nWe have to ask ourselves, are the benefits being identified?\nWhat are these benefits that the organization\nseems to want or to get?\nThen you wanna document the agreements\non ownerships for ongoing benefits realization.\nThe benefits management plan,\nwe talked about this in project charter.\nThe benefits management plan,\nwe're gonna have to doc what is the benefit we're getting?\nDocument it.\nHave ownership.\nLet people know these are the benefits you're gonna get.\nVerify a measurement system is in place\nto track these benefits.\nThere's two ways to track benefits,\nsubjective and objective tracking methods.\nA subjective method is,\noh, with the benefits has been realized.\nIt's great benefits.\nAn objective can actually be numerical tracking.\nTake for example, if you're doing an accounting system\nto increase the efficiency in the accounting department.\nMaybe before it took 20 minutes to produce a report,\nfinancial report,\nbut with this new software,\nwe can do it now within five minutes.\nThis is an objective numerical system\nto keep track of the benefits.\nYou just can't keep doing things\nand not have a way to track it.\nNow I'm just giving you some different ways there.\nThere are many other ways of doing this.\nEvaluate delivery options to demonstrate value.\nUse an MVP, a minimum viable product.\nHave the customer comes in\nwhen you're doing those sprint review,\niteration review minutes.\nEvaluate those delivery options of to demonstrate value.\nCustomers needs to see that the project is progressing\nand is delivering value,\nwhether it's giving them small increments of it\nor at least getting their review on it.\nAppraisal stakeholder is the value gain on the project.\nLet them know that,\n\"Hey, these are the value we're gaining on the project.\"\nLet them know repeatedly.\nLet them see it.\nLet them play with it.\nGive it to them if you could if it's a agile project.\nOnce again, the objective of a project is to do what?\nIs to provide value.\nAnd how do we provide value?\nWe provide value by conducting the work\nand doing it correctly.\nBut we need to wait to measure this.\nWe need to identify it.\nWe need to track it,\nand we need to demonstrate it to our stakeholders\nthat this project is delivering benefits and value.",
          "keyConcepts": [
            "agile",
            "mvp",
            "project charter",
            "evaluate",
            "deliver",
            "benefits"
          ],
          "transcriptLines": {
            "start": 18999,
            "end": 19124
          },
          "agileRelevance": "medium",
          "predictiveRelevance": "medium"
        },
        {
          "id": "d3t3",
          "taskNumber": "Task 3",
          "title": "Evaluate and address external business environment changes for impact on scope",
          "fullTitle": "Domain 3 Task 3: Evaluate and address external business environment changes for impact on scope",
          "content": "--- Domain 3 Task 3 ---\n\n-: In this video\nI'm gonna be taking a look at Domain 3: Task 3,\nevaluate and address\nexternal business environment changes\nfor impact on scope.\nYeah, it's a pretty big one.\nYou know what?\nLemme put this on the screen here\nbecause it's a lot there to read.\nSo what are we doing here?\nIn this one here,\nwe're gonna be taking a look at evaluating\nand addressing external business environment changes\non impact on the scope.\nWhat are we talking about here?\nWe're talking about\nexternal business environment things\nthat can change or impact the project scope.\nAnd those changes can be things like regulations,\nchanges in technology,\nchanges in the...\nin the market itself\nor changes within your industry.\nThere's a lot of different things that can happen\nthat's external to the project\nthat could have a drastic impact to the project,\nexternal to the organization.\nFor example, what if one day you wake up\nand there's some kind of regulation\nthat just took place\nthat has a drastic impact.\nWhat if the next week you wake up\nand there's a pandermic that shut the whole world down?\nPandemic, I should say,\nI always mispronounced that word.\nSo there are always different changes\nto the external environment could have drastic impact.\nWhat if there's a new type of technology,\na new artificial intelligence that came out\nthat could drastically impact the project\nor change the scope of the project?\nThese are things that we have to know.\nThese are things that\nwe as project managers should be observant\nand be familiar with.\nWhen these types of things happen\nyou want to assess and prioritize the impact\non the project scope or the backlog\nbased on changes in the external environment.\nWhen these changes happen\nand they start to impact your project,\nso for example,\nif it's a regulatory change\nit probably goes high up in the product backlog.\nIt must get done\nor it goes directly into the scope it must get done.\nIf it's something within the market\nthat may or may not\nprovide much value to our product,\nit may go to the middle\nof the product backlog.\nIt may not even get added to the product scope.\nIt may not even be too so prioritized.\nBut, it depends on the change,\nit depends on how it impacts,\nit depends on the project,\ndepends on the product you're working on.\nThen you have to recommend\noptions for scope changes.\nLike, when you change the scope,\nfor example, if it's a regulatory change,\nhow does it impact the costs?\nHow does it impact the schedule?\nWhat are the risks?\nHow does it impact the resources?\nOr the procurement section?\nRemember, anytime you put in a change\nit's gonna have a lot\nit's gonna scope changes,\nhas a ripple effect\nthroughout the entire project.\nSo you're gonna wanna make sure\nyou come up with options\nof how we can get this done,\nanalyze it.\nAnd then of course,\nyou can't get a good night's sleep.\nAs a project manager\nyou're not gonna sleep well.\nYou know why?\nBecause you have to continuously review external bis...\nthe external business environment\nfor impact on your project scope and your backlog, right?\nYour project backlog.\nWhy?\nBecause external changes happens all the time\nand it's not in your control.\nWhat happens in Washington DC\nin terms of education\nand what laws they might be producing\nthat we're gonna have to soon be following\nis maybe not something I can control.\nMe personally, no,\nI can't control it,\nI just follow what they tell me.\nHopefully it's the benefit of our students.\nAnd they, there were times\nwhen I was managing this school that\nregulations were passed that I wasn't aware of.\nAnd when we do become aware of 'em\nwe gotta make sure we implement them.\nSo the, you know,\nthis is where I failed, right?\nBecause I wasn't consistently\nreviewing what's happening\nin the business environment around me,\n'cause regulations happen pretty quickly.\nSo in this particular one,\nalways evaluate,\nalways know what's happening around you.\nExternal to the project,\nexternal to the organization,\nthat way if they happen they're not a surprise\nand your project is always in compliance.",
          "keyConcepts": [
            "product backlog",
            "risk",
            "scope",
            "procurement",
            "compliance",
            "evaluate",
            "address",
            "external",
            "business",
            "environment"
          ],
          "transcriptLines": {
            "start": 19124,
            "end": 19251
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        },
        {
          "id": "d3t4",
          "taskNumber": "Task 4",
          "title": "Support organizational change",
          "fullTitle": "Domain 3 Task 4: Support organizational change",
          "content": "--- Domain 3 Task 4 ---\n\n-: In this video, I'm gonna be going over\nDomain 3: Task 4, Support Organizational Change.\nBefore I get started on this, lemme just say this.\nI believe that there is one thing\nthat an organization need to have\nin order to pass the test of time.\nThe test of time is the ultimate thing.\nThat test of time is the ultimate thing\nthat will kill organizations.\nVery few organizations will last more than one year.\nEven more so, very few will ever last 10 years.\nHere at TIA, we celebrated our 10 year from 2012 to 2020.\nWe celebrated our 10th year anniversary in 2018.\nI was very proud of that because any organization\nin today's world that can survive\nfor 10 years in midtown Manhattan, our biggest location,\nis a pretty big accomplishment.\nHopefully we can do another 10 years and another 10 years\nuntil I'm old enough to sell it and then I can retire.\nBut anyhow, what does it take?\nWhat is the single most important factor\nthat the organization needs to have to sustain,\nto pass I should say, the test of time?\nThat is to build a culture of organizational change.\nAn organization needs to have a culture\nthat embraces change.\nThe organization has to change with time.\nI have seen TIA change so much, not just because of me,\nbut because of all the people that work here.\nSo many new courses we've implemented, so many ways.\nYou can see how the evolution of this course has gone\nfrom the very beginning when I started it\nto now this version of it.\nHopefully you enjoy this version more\nthan you did in the beginning.\nHow do we build this culture?\nThat's beyond the scope of this course,\nbut we have to assess it, we have to know what it is,\nwe have to embrace it.\nBy changing an organization is gonna develop new products\nand services that meets the market's requirements.\nIs gonna help to improve their customer satisfaction.\nIs gonna help to improve their employee loyalty.\nWe want to, first of all, assess the organization culture.\nAre they willing to change or are they not?\nIf you guy remember Blackberry.\nYou know Blackberry was an organization\nthat pretty much created that market space of smartphones\nand then now they're dead.\nThey went from being a high company\nwith a good stock price and it had great devices.\nNow they're pretty much dead.\nWhy?\nBecause they didn't change.\nTheir culture just wasn't there to change\nfor whatever reason.\nSo we wanna assess\nthat organizational culture to see how they change.\nAnd this is gonna be having a big impact on your project.\nEvaluate impact on the organizational change\nto project and determine required action.\nThink about this for a second.\nIn the organization, if you work in an organization\nthat changes a lot, and that's a good thing.\nNothing wrong with that,\nbut you have to be prepared to deal with these changes.\nHere's why.\nIf you work in R&amp;D, research and development,\nyou know what I'm talking about,\nbecause you start working on a project.\n(snapping fingers)\nJust like that, it's axed.\nThey kill it.\nWell, we don't wanna go down that direction anymore.\nThat doesn't align with our values anymore.\nWe decided to create a brand new product,\nyet they killed your action, they killed your project.\nSo the organizational change can ripple\ndown the organization.\nWe're gonna change direction.\nWe were producing gasoline cars.\nNow we're gonna be producing electric cars.\nOh, all those cars, they're axed.\nWe don't need 'em anymore.\nSo the organization change will have rippled\ndown to the different projects within it.\nWe have to evaluate the impact of the project\nto the organization and determine required action.\nWhen a project is done,\nit's gonna have some kind of impact to that organization.\nHopefully driving value, increasing revenue,\ndecreasing expenses,\nbasically what hopefully these projects are doing.\nOkay, so in this particular task,\nsupport the organizational change.\nKnow what it is, promote this organization culture,\nand understand that when there's changes\nwithin the organization,\nit can have either a positive\nor negative effect on your project.\n\n--- Drag and Drop 1 ---\n\nInstructor: In this video, what I'm gonna be doing\nis I'm gonna be showing you how to do a drag-and-drop\nwhere you have to match up the processes,\nand here you have a few different processes,\nto the actual process groups themselves.\nAnd this is a very famous drag-and-drop,\nthat you probably should expect to see on your exam.\nSo you're gonna wanna make sure\nthat you know your 49 processes very well\nand you're gonna wanna make sure\nthat you know where these 49 processes work.\nSo as I go through the 49 processes,\nwe're gonna do a little bit of review,\nand I'll talk about the process,\nand I'll give you a little description of what they are.\nOkay, so what I'm gonna do here is...\nWhat I want you guys to do,\nis I'm just gonna move the mouse out of the way here.\nAnd what I want you guys to do\nis just to take out a pen and paper right now.\nI want you guys to pause the video right about here,\nand go ahead and try this dr",
          "keyConcepts": [
            "scope",
            "organizational",
            "change"
          ],
          "transcriptLines": {
            "start": 19251,
            "end": 19400
          },
          "agileRelevance": "low",
          "predictiveRelevance": "high"
        }
      ]
    }
  ]
}